-- Filename: DB_AchieTable.lua
-- Author: auto-created by XmlToScript tool.
-- Function: it`s auto-created by XmlToScript tool.

module("DB_AchieTable", package.seeall)

keys = {
	"id", "parent_type", "child_type", "achie_name", "achie_des", "achie_icon", "achie_quality", "finish_arry", "achie_reward", 
}

AchieTable = {
	id_101001 = {101001, 1, 101, "桃源卫士", "通关桃源村副本", "9", 5, "1|1", "5|0|4", },
	id_102001 = {102001, 1, 102, "50星", "副本星数达到50", "1", 1, "50", "3|0|20", },
	id_103001 = {103001, 1, 103, "黄金之乱", "通关精英副本黄巾之乱", "3", 1, "200001|1", "5|0|4", },
	id_105001 = {105001, 1, 105, "下邳勇士", "通关军团副本下邳军团", "10", 3, "400102|1", "10|410047|1", },
	id_104001 = {104001, 1, 104, "伤害十万", "挑战摇钱树伤害达到10W", "9", 2, "100000", "11|0|150", },
	id_106001 = {106001, 1, 106, "竞技新星", "参与竞技场排名达到1000", "4", 4, "1000", "4|0|5", },
	id_107001 = {107001, 1, 107, "武林榜眼", "参与比武排名达到1000", "10", 1, "1000", "13|410050|1", },
	id_209001 = {209001, 1, 209, "夺宝奇兵", "参与夺宝次数达到10", "3", 4, "10", "11|0|150", },
	id_201001 = {201001, 2, 201, "初出桃源", "主角等级达到10级", "4", 5, "20", "10|410047|1", },
	id_202001 = {202001, 2, 202, "天命所归", "点亮10个天命", "9", 1, "10", "12|0|120", },
	id_208001 = {208001, 2, 208, "高朋满座", "好友数量达到10", "2", 2, "10", "3|0|20", },
	id_212001 = {212001, 2, 212, "跨种杂交", "获得2种不同宠物", "5", 5, "2", "5|0|4", },
	id_214001 = {214001, 2, 214, "屠龙勇士", "参与击杀青龙魔神2次", "2", 5, "2", "8|0|1", },
	id_215001 = {215001, 2, 215, "青龙降服", "挑战青龙魔神伤害排名达到1", "9", 2, "1", "10|410047|1", },
	id_216001 = {216001, 2, 216, "兵之试练", "通关试练塔第10层", "12", 4, "10", "10|410047|1", },
	id_217001 = {217001, 2, 217, "骁勇善战", "战斗力达到1万", "11", 3, "10000", "4|0|5", },
	id_218001 = {218001, 2, 218, "双宿双飞", "上阵2个武将", "6", 2, "2", "11|0|150", },
	id_219001 = {219001, 2, 219, "亲密无间", "上阵2个小伙伴", "2", 5, "2", "2|0|80", },
	id_220001 = {220001, 2, 220, "夜观星相", "占星累计获得140积分", "13", 4, "140", "2|0|80", },
	id_221001 = {221001, 2, 221, "军团新兵", "加入军团且军团等级3级", "11", 3, "3", "9|0|1", },
	id_222001 = {222001, 2, 222, "尽职尽责", "军团个人总贡献达到500", "9", 1, "500", "4|0|5", },
	id_223001 = {223001, 2, 223, "齐心协力", "参加1次城池争夺战", "10", 3, "1", "12|0|120", },
	id_224001 = {224001, 2, 224, "占山为王", "所在军团占领1个城池", "10", 1, "1", "1|0|100", },
	id_301001 = {301001, 3, 301, "蓝颜知己", "获得一个4星武将", "1", 4, "4", "5|0|4", },
	id_302001 = {302001, 3, 302, "猛将如云", "获得10位不同武将", "5", 2, "10", "4|0|5", },
	id_303001 = {303001, 3, 303, "功力大增", "主角进阶等级达到4", "9", 3, "4", "5|0|4", },
	id_304001 = {304001, 3, 304, "强身健体", "任意武将进阶等级达到3", "4", 4, "3", "7|30012|6", },
	id_305001 = {305001, 3, 305, "名将之友", "名将好感等级达到66", "1", 3, "66", "4|0|5", },
	id_306001 = {306001, 3, 306, "统御全军", "任意武将等级达到20级", "2", 2, "20", "5|0|4", },
	id_307001 = {307001, 3, 307, "蓝色武魂", "通过武魂合成蓝色英雄1个", "8", 5, "3|1", "8|0|1", },
	id_307101 = {307101, 3, 307, "紫色武魂", "通过武魂合成紫色英雄1个", "8", 2, "4|1", "8|0|1", },
	id_401001 = {401001, 3, 401, "绿林好汉", "获得2件绿色品质装备", "13", 1, "2", "13|410050|1", },
	id_402001 = {402001, 3, 402, "翠色欲流", "获得2件绿色品质宝物", "1", 4, "2", "14|5025011|1", },
	id_403001 = {403001, 3, 403, "长戟高门", "获得10种不同装备", "13", 5, "10", "8|0|1", },
	id_404001 = {404001, 4, 404, "琳琅满目", "获得5种不同宝物", "11", 4, "5", "1|0|100", },
	id_203001 = {203001, 4, 203, "绿色战魂", "获得任意2个绿色战魂", "10", 4, "2", "2|0|80", },
	id_204001 = {204001, 4, 204, "三魂七魄", "获得任意10种不同战魂", "8", 5, "10", "12|0|120", },
	id_405001 = {405001, 4, 405, "炉火纯青", "任意战魂等级达到5级", "13", 4, "5", "7|30012|6", },
	id_406001 = {406001, 4, 406, "物华天宝", "任意宝物等级达到5级", "5", 4, "5", "10|410047|1", },
	id_407001 = {407001, 4, 407, "精雕细琢", "任意一件宝物精炼2钻", "9", 5, "2", "1|0|100", },
	id_408001 = {408001, 4, 408, "锦罗玉衣", "任意获得一件时装", "12", 4, "1", "4|0|5", },
	id_409001 = {409001, 4, 409, "初露锋芒", "任意装备强化到20级", "6", 5, "20", "13|410050|1", },
	id_410001 = {410001, 4, 410, "巧夺天工", "累计洗练20次装备", "12", 3, "20", "12|0|120", },
}

local mt = {}
mt.__index = function (table, key)
	for i = 1, #keys do
		if (keys[i] == key) then
			return table[i]
		end
	end
end

function getDataById(key_id)
	local id_data = AchieTable["id_" .. key_id]
	if id_data == nil then
		return nil
	end
	if getmetatable(id_data) ~= nil then
		return id_data
	end
	setmetatable(id_data, mt)

	return id_data
end

function getArrDataByField(fieldName, fieldValue)
	local arrData = {}
	local fieldNo = 1
	for i=1, #keys do
		if keys[i] == fieldName then
			fieldNo = i
			break
		end
	end
	for k, v in pairs(AchieTable) do
		if v[fieldNo] == fieldValue then
			setmetatable (v, mt)
			arrData[#arrData+1] = v
		end
	end

	return arrData
end

function release()
	_G["DB_AchieTable"] = nil
	package.loaded["db/DB_AchieTable"] = nil
	package.loaded["DB_AchieTable"] = nil
end

