-- Filename: DB_Corps_quest.lua
-- Author: auto-created by XmlToScript tool.
-- Function: it`s auto-created by XmlToScript tool.

module("DB_Corps_quest", package.seeall)

keys = {
	"id", "questType", "questName", "questStar", "randomProbability", "needBulidLevel", "completeConditions", "questExplain", "questReward", "completeImmediately", "iconId", "heroId", "heroTalk", "quickTo", "needCity", "costEnergy", 
}

Corps_quest = {
	id_1000 = {1000, 1, "贡献装备", 1, 22500, 0, "1,2,1", "捐献1个白色品质的武器", "15|0|50,16|0|50,1|0|15000", 10, "head_guanping.png", "quan_jiang_guanping.png", "练兵最重要的就是兵器了！", 1, 0, 0, },
	id_1001 = {1001, 1, "贡献装备", 1, 22500, 0, "2,2,1", "捐献1个白色品质的护甲", "15|0|50,16|0|50,1|0|15000", 10, "head_huangfusong.png", "quan_jiang_huangfusong.png", "衣不蔽体？那怎么行呢？", 1, 0, 0, },
	id_1002 = {1002, 1, "贡献装备", 1, 22500, 0, "3,2,1", "捐献1个白色品质的头盔", "15|0|50,16|0|50,1|0|15000", 10, "head_caoang.png", "quan_jiang_caoang.png", "保住脑袋才是最重要的！", 1, 0, 0, },
	id_1003 = {1003, 1, "贡献装备", 2, 8750, 1, "1,2,1", "捐献1个白色品质的武器", "15|0|100,16|0|100,1|0|22500", 10, "head_chengpu.png", "quan_jiang_chengpu.png", "练兵最重要的就是兵器了！", 1, 0, 0, },
	id_1004 = {1004, 1, "贡献装备", 2, 8750, 1, "2,2,1", "捐献1个白色品质的护甲", "15|0|100,16|0|100,1|0|22500", 10, "head_caohong.png", "quan_jiang_caohong.png", "衣不蔽体？那怎么行呢？", 1, 0, 0, },
	id_1005 = {1005, 1, "贡献装备", 2, 8750, 1, "3,2,1", "捐献1个白色品质的头盔", "15|0|100,16|0|100,1|0|22500", 10, "head_zhugejin.png", "quan_jiang_zhugejin.png", "保住脑袋才是最重要的！", 1, 0, 0, },
	id_1006 = {1006, 1, "贡献装备", 2, 8750, 2, "3,3,1", "捐献1个绿色品质的头盔", "15|0|100,16|0|100,1|0|22500", 10, "head_huangfusong.png", "quan_jiang_huangfusong.png", "什么？你一定要送我这条项链？", 1, 0, 0, },
	id_1007 = {1007, 1, "贡献装备", 2, 8750, 2, "1,3,1", "捐献1个绿色品质的武器", "15|0|100,16|0|100,1|0|22500", 10, "head_lukang.png", "quan_jiang_lukang.png", "绿油油的武器，我最喜欢了！", 1, 0, 0, },
	id_1008 = {1008, 1, "贡献装备", 2, 8750, 2, "2,3,1", "捐献1个绿色品质的护甲", "15|0|100,16|0|100,1|0|22500", 10, "head_zhugejin.png", "quan_jiang_zhugejin.png", "亲爱的，我的官服去哪了？", 1, 0, 0, },
	id_1009 = {1009, 1, "贡献装备", 3, 2084, 3, "1,2,2", "捐献2个白色品质的武器", "15|0|200,16|0|200,1|0|30000", 20, "head_xuhuang.png", "quan_jiang_xuhuang.png", "武器库的库存不多了啊…", 1, 0, 0, },
	id_1010 = {1010, 1, "贡献装备", 3, 2084, 3, "2,2,2", "捐献2个白色品质的护甲", "15|0|200,16|0|200,1|0|30000", 20, "head_zhurong.png", "quan_jiang_zhurong.png", "别看我穿的少，但我至少还是穿着的！", 1, 0, 0, },
	id_1011 = {1011, 1, "贡献装备", 3, 2084, 3, "3,2,2", "捐献2个白色品质的头盔", "15|0|200,16|0|200,1|0|30000", 20, "head_caopei.png", "quan_jiang_caopei.png", "你，就是你，给我弄两顶帽子来！", 1, 0, 0, },
	id_1012 = {1012, 1, "贡献装备", 3, 2084, 4, "3,3,2", "捐献2个绿色品质的头盔", "15|0|200,16|0|200,1|0|30000", 20, "head_wenchou.png", "quan_jiang_wenchou.png", "主公赏赐给我的项链，你见到了么？", 1, 0, 0, },
	id_1013 = {1013, 1, "贡献装备", 3, 2084, 4, "1,3,2", "捐献2个绿色品质的武器", "15|0|200,16|0|200,1|0|30000", 20, "head_chengong.png", "quan_jiang_chengong.png", "哼，打打杀杀什么的最喜欢了！", 1, 0, 0, },
	id_1014 = {1014, 1, "贡献装备", 3, 2084, 4, "2,3,2", "捐献2个绿色品质的护甲", "15|0|200,16|0|200,1|0|30000", 20, "head_daqiao.png", "quan_jiang_daqiao.png", "你说我穿这件，还是那件好看？", 1, 0, 0, },
	id_1015 = {1015, 1, "贡献装备", 3, 2084, 5, "3,3,1", "捐献1个绿色品质的头盔", "15|0|200,16|0|200,1|0|30000", 20, "head_xiaoqiao.png", "quan_jiang_xiaoqiao.png", "让我看看，你的帽子带歪了哦。", 1, 0, 0, },
	id_1016 = {1016, 1, "贡献装备", 3, 2084, 5, "2,3,1", "捐献1个绿色品质的护甲", "15|0|200,16|0|200,1|0|30000", 20, "head_xuhuang.png", "quan_jiang_xuhuang.png", "谁说男人不能戴项链了！", 1, 0, 0, },
	id_1017 = {1017, 1, "贡献装备", 3, 2084, 5, "1,3,1", "捐献1个绿色品质的武器", "15|0|200,16|0|200,1|0|30000", 20, "head_yanliang.png", "quan_jiang_yanliang.png", "待我挑把武器再跟关羽一战！", 1, 0, 0, },
	id_1018 = {1018, 1, "贡献装备", 4, 834, 6, "1,2,2", "捐献2个白色品质的武器", "15|0|400,16|0|400,1|0|45000", 20, "head_xushu.png", "quan_jiang_xushu.png", "要破八门金锁，武器是断不可缺的的。", 1, 0, 0, },
	id_1019 = {1019, 1, "贡献装备", 4, 834, 6, "2,2,2", "捐献2个白色品质的护甲", "15|0|400,16|0|400,1|0|45000", 20, "head_chendeng.png", "quan_jiang_chendeng.png", "看到街上的百姓们衣不蔽体我于心不忍啊。", 1, 0, 0, },
	id_1020 = {1020, 1, "贡献装备", 4, 834, 6, "3,2,2", "捐献2个白色品质的头盔", "15|0|400,16|0|400,1|0|45000", 20, "head_xiaoqiao.png", "quan_jiang_xiaoqiao.png", "这次我想送两件帽子给他呢~", 1, 0, 0, },
	id_1021 = {1021, 1, "贡献装备", 4, 834, 7, "3,3,2", "捐献2个绿色品质的头盔", "15|0|400,16|0|400,1|0|45000", 20, "head_xiaoqiao.png", "quan_jiang_xiaoqiao.png", "这次我想送两条项链给他呢~", 1, 0, 0, },
	id_1022 = {1022, 1, "贡献装备", 4, 834, 7, "1,3,2", "捐献2个绿色品质的武器", "15|0|400,16|0|400,1|0|45000", 20, "head_liubei.png", "quan_jiang_liubei.png", "还是双刀流好使啊！", 1, 0, 0, },
	id_1023 = {1023, 1, "贡献装备", 4, 834, 7, "2,3,2", "捐献2个绿色品质的护甲", "15|0|400,16|0|400,1|0|45000", 20, "head_zhanghe.png", "quan_jiang_zhanghe.png", "要想防偷袭，护甲是关键！", 1, 0, 0, },
	id_1024 = {1024, 1, "贡献装备", 4, 834, 8, "3,3,2", "捐献2个绿色品质的头盔", "15|0|400,16|0|400,1|0|45000", 20, "head_yuanshao.png", "quan_jiang_yuanshao.png", "头盔，头盔你要去哪里！", 1, 0, 0, },
	id_1025 = {1025, 1, "贡献装备", 4, 834, 8, "2,3,2", "捐献2个绿色品质的护甲", "15|0|400,16|0|400,1|0|45000", 20, "head_huaxiong.png", "quan_jiang_huaxiong.png", "只有这样的项链才能配得上我的胸肌！", 1, 0, 0, },
	id_1026 = {1026, 1, "贡献装备", 4, 834, 8, "1,3,2", "捐献2个绿色品质的武器", "15|0|400,16|0|400,1|0|45000", 20, "head_daqiao.png", "quan_jiang_daqiao.png", "夫君让我找你要点武器哦~", 1, 0, 0, },
	id_1027 = {1027, 1, "贡献装备", 5, 417, 9, "1,2,3", "捐献3个白色品质的武器", "15|0|800,16|0|800,1|0|60000", 30, "head_zuoci.png", "quan_jiang_zuoci.png", "我变个武器给你看信不信？", 1, 0, 0, },
	id_1028 = {1028, 1, "贡献装备", 5, 417, 9, "2,2,3", "捐献3个白色品质的护甲", "15|0|800,16|0|800,1|0|60000", 30, "head_huatuo.png", "quan_jiang_huatuo.png", "总有人说我太暴露了。", 1, 0, 0, },
	id_1029 = {1029, 1, "贡献装备", 5, 417, 9, "3,2,3", "捐献3个白色品质的头盔", "15|0|800,16|0|800,1|0|60000", 30, "head_xiahoudun.png", "quan_jiang_xiahoudun.png", "没有人能比我更明白头盔的重要。", 1, 0, 0, },
	id_1030 = {1030, 1, "贡献装备", 5, 417, 10, "3,3,3", "捐献3个绿色品质的头盔", "15|0|800,16|0|800,1|0|60000", 30, "head_yuji.png", "quan_jiang_yuji.png", "想我帮你？贡品呢？", 1, 0, 0, },
	id_1031 = {1031, 1, "贡献装备", 5, 417, 10, "1,3,3", "捐献3个绿色品质的武器", "15|0|800,16|0|800,1|0|60000", 30, "head_zhaoyun.png", "quan_jiang_zhaoyun.png", "手脚并用的感觉，你不会懂。", 1, 0, 0, },
	id_1032 = {1032, 1, "贡献装备", 5, 417, 10, "2,3,3", "捐献3个绿色品质的护甲", "15|0|800,16|0|800,1|0|60000", 30, "head_luxun.png", "quan_jiang_luxun.png", "快给我弄点盔甲来！", 1, 0, 0, },
	id_1033 = {1033, 1, "贡献装备", 5, 417, 11, "3,4,1", "捐献1个蓝色品质的头盔", "15|0|800,16|0|800,1|0|60000", 30, "head_ganning.png", "quan_jiang_ganning.png", "水军的头盔是可以当水盆的！", 1, 0, 0, },
	id_1034 = {1034, 1, "贡献装备", 5, 417, 11, "2,4,1", "捐献1个蓝色品质的护甲", "15|0|800,16|0|800,1|0|60000", 30, "head_guojia.png", "quan_jiang_guojia.png", "我要给我的鸟们一只一条项链。", 1, 0, 0, },
	id_1035 = {1035, 1, "贡献装备", 5, 417, 11, "1,4,1", "捐献1个蓝色品质的武器", "15|0|800,16|0|800,1|0|60000", 30, "head_zhugeliang.png", "quan_jiang_zhugeliang.png", "快给我找几把武器来！", 1, 0, 0, },
	id_2000 = {2000, 2, "贡献宝物", 1, 33750, 0, "1,3,1", "捐献1个绿色品质的战马", "15|0|50,16|0|50,1|0|20000", 10, "head_yuanshu.png", "quan_jiang_yuanshu.png", "我有一只小毛驴我从来也不骑！", 2, 0, 0, },
	id_2001 = {2001, 2, "贡献宝物", 1, 33750, 1, "2,3,1", "捐献1个绿色品质的兵书", "15|0|50,16|0|50,1|0|20000", 10, "head_bulianshi.png", "quan_jiang_bulianshi.png", "女人也要多读点书哦！", 2, 0, 0, },
	id_2002 = {2002, 2, "贡献宝物", 2, 26250, 2, "1,3,1", "捐献1个绿色品质的战马", "15|0|100,16|0|100,1|0|30000", 10, "head_lidian.png", "quan_jiang_lidian.png", "这次我要上贡一匹骏马，你会帮我吧！", 2, 0, 0, },
	id_2003 = {2003, 2, "贡献宝物", 2, 26250, 3, "2,3,1", "捐献1个绿色品质的兵书", "15|0|100,16|0|100,1|0|30000", 10, "head_xunyou.png", "quan_jiang_xunyou.png", "知之为知之，不知为不知。", 2, 0, 0, },
	id_2004 = {2004, 2, "贡献宝物", 3, 4688, 4, "1,3,2", "捐献2个绿色品质的战马", "15|0|200,16|0|200,1|0|40000", 20, "head_yanliang.png", "quan_jiang_yanliang.png", "虽然没有赤兔，但我也有自己的战马！", 2, 0, 0, },
	id_2005 = {2005, 2, "贡献宝物", 3, 4688, 5, "2,3,2", "捐献2个绿色品质的兵书", "15|0|200,16|0|200,1|0|40000", 20, "head_lusu.png", "quan_jiang_lusu.png", "孩子，多读点书吧！", 2, 0, 0, },
	id_2006 = {2006, 2, "贡献宝物", 3, 4688, 6, "1,3,2", "捐献2个绿色品质的战马", "15|0|200,16|0|200,1|0|40000", 20, "head_huangzhong.png", "quan_jiang_huangzhong.png", "来人！快扶老夫上马！", 2, 0, 0, },
	id_2007 = {2007, 2, "贡献宝物", 3, 4688, 7, "2,3,2", "捐献2个绿色品质的兵书", "15|0|200,16|0|200,1|0|40000", 20, "head_lejin.png", "quan_jiang_lejin.png", "兵书才是万人敌！", 2, 0, 0, },
	id_2008 = {2008, 2, "贡献宝物", 4, 1875, 8, "1,3,2", "捐献2个绿色品质的战马", "15|0|400,16|0|400,1|0|60000", 20, "head_wenchou.png", "quan_jiang_wenchou.png", "虽然没有赤兔，但我也有自己的战马！", 2, 0, 0, },
	id_2009 = {2009, 2, "贡献宝物", 4, 1875, 9, "2,3,2", "捐献2个绿色品质的兵书", "15|0|400,16|0|400,1|0|60000", 20, "head_weiyan.png", "quan_jiang_weiyan.png", "军师说让我多读点书。", 2, 0, 0, },
	id_2010 = {2010, 2, "贡献宝物", 4, 1875, 10, "1,3,2", "捐献2个绿色品质的战马", "15|0|400,16|0|400,1|0|60000", 20, "head_yujin.png", "quan_jiang_yujin.png", "马儿乖。", 2, 0, 0, },
	id_2011 = {2011, 2, "贡献宝物", 4, 1875, 11, "2,3,2", "捐献2个绿色品质的兵书", "15|0|400,16|0|400,1|0|60000", 20, "head_caoren.png", "quan_jiang_caoren.png", "读书什么的，最烦人了！", 2, 0, 0, },
	id_2012 = {2012, 2, "贡献宝物", 5, 938, 12, "1,3,3", "捐献3个绿色品质的战马", "15|0|800,16|0|800,1|0|80000", 30, "head_sunce.png", "quan_jiang_sunce.png", "从此以后，你就是霸王马了！", 2, 0, 0, },
	id_2013 = {2013, 2, "贡献宝物", 5, 938, 13, "2,3,3", "捐献3个绿色品质的兵书", "15|0|800,16|0|800,1|0|80000", 30, "head_zhouyu.png", "quan_jiang_zhouyu.png", "我的藏书不太够了啊。", 2, 0, 0, },
	id_2014 = {2014, 2, "贡献宝物", 5, 938, 14, "1,3,3", "捐献3个绿色品质的战马", "15|0|800,16|0|800,1|0|80000", 30, "head_zhouyu.png", "quan_jiang_zhouyu.png", "我的藏马不太够了啊。", 2, 0, 0, },
	id_2015 = {2015, 2, "贡献宝物", 5, 938, 15, "2,3,3", "捐献3个绿色品质的兵书", "15|0|800,16|0|800,1|0|80000", 30, "head_zuoci.png", "quan_jiang_zuoci.png", "那，我变本书给你看信不信？", 2, 0, 0, },
	id_4000 = {4000, 4, "攻打据点", 1, 7106, 0, "1,1006,1", "攻打1次桃源村副本张宝据点", "15|0|50,16|0|50,1|0|15000", 10, "head_xinxianying.png", "quan_jiang_xinxianying.png", "快去讨伐桃源村的张宝！", 4, 0, 0, },
	id_4001 = {4001, 4, "攻打据点", 1, 7106, 0, "2,2007,1", "攻打1次黄巾之乱副本张角据点", "15|0|50,16|0|50,1|0|15000", 10, "head_huangfusong.png", "quan_jiang_huangfusong.png", "快去讨伐黄巾之乱的张角！", 4, 0, 0, },
	id_4002 = {4002, 4, "攻打据点", 1, 7106, 1, "3,3008,1", "攻打1次虎牢关上副本华雄据点", "15|0|50,16|0|50,1|0|15000", 10, "head_zhangbao_1.png", "quan_jiang_zhangbao_1.png", "快去讨伐虎牢关上的华雄！", 4, 0, 0, },
	id_4003 = {4003, 4, "攻打据点", 1, 7106, 1, "4,4010,1", "攻打1次虎牢关下副本吕布据点", "15|0|50,16|0|50,1|0|15000", 10, "head_lidian.png", "quan_jiang_lidian.png", "快去讨伐虎牢关下的吕布！", 4, 0, 0, },
	id_4004 = {4004, 4, "攻打据点", 1, 7106, 2, "5,5010,1", "攻打1次长安诛董卓上副本贾诩据点", "15|0|50,16|0|50,1|0|15000", 10, "head_jiling.png", "quan_jiang_jiling.png", "快去讨伐长安诛董卓上的贾诩！", 4, 0, 0, },
	id_4005 = {4005, 4, "攻打据点", 1, 7106, 2, "6,6010,1", "攻打1次长安诛董卓下副本董卓据点", "15|0|50,16|0|50,1|0|15000", 10, "head_dingyuan.png", "quan_jiang_dingyuan.png", "快去讨伐长安诛董卓下的董卓！", 4, 0, 0, },
	id_4006 = {4006, 4, "攻打据点", 1, 7106, 3, "7,7010,1", "攻打1次濮阳之战副本张辽据点", "15|0|50,16|0|50,1|0|15000", 10, "head_manchong.png", "quan_jiang_manchong.png", "快去讨伐濮阳之战的张辽！", 4, 0, 0, },
	id_4007 = {4007, 4, "攻打据点", 1, 7106, 3, "8,8010,1", "攻打1次徐州之争副本陈宫据点", "15|0|50,16|0|50,1|0|15000", 10, "head_xunyou.png", "quan_jiang_xunyou.png", "快去讨伐徐州之争的陈宫！", 4, 0, 0, },
	id_4008 = {4008, 4, "攻打据点", 1, 7106, 4, "9,9010,1", "攻打1次水淹下邳上副本张辽据点", "15|0|50,16|0|50,1|0|15000", 10, "head_guanxing.png", "quan_jiang_guanxing.png", "快去讨伐水淹下邳上的张辽！", 4, 0, 0, },
	id_4009 = {4009, 4, "攻打据点", 1, 7106, 4, "10,10010,1", "攻打1次水淹下邳下副本吕布据点", "15|0|50,16|0|50,1|0|15000", 10, "head_zhangbao.png", "quan_jiang_zhangbao.png", "快去讨伐水淹下邳下的吕布！", 4, 0, 0, },
	id_4010 = {4010, 4, "攻打据点", 1, 7106, 5, "11,11010,1", "攻打1次寿春战役上副本张勋据点", "15|0|50,16|0|50,1|0|15000", 10, "head_guanping.png", "quan_jiang_guanping.png", "快去讨伐寿春战役上的张勋！", 4, 0, 0, },
	id_4011 = {4011, 4, "攻打据点", 2, 7000, 5, "12,12010,1", "攻打1次寿春战役下副本袁术据点", "15|0|100,16|0|100,1|0|22500", 10, "head_xuyou.png", "quan_jiang_xuyou.png", "快去讨伐寿春战役下的袁术！", 4, 0, 0, },
	id_4012 = {4012, 4, "攻打据点", 2, 7000, 6, "13,13010,1", "攻打1次宛城之战副本张绣据点", "15|0|100,16|0|100,1|0|22500", 10, "head_xunyou.png", "quan_jiang_xunyou.png", "快去讨伐宛城之战的张绣！", 4, 0, 0, },
	id_4013 = {4013, 4, "攻打据点", 2, 7000, 6, "14,14010,1", "攻打1次魔阵披挂副本孙坚据点", "15|0|100,16|0|100,1|0|22500", 10, "head_caoang.png", "quan_jiang_caoang.png", "快去讨伐魔阵披挂的孙坚！", 4, 0, 0, },
	id_4014 = {4014, 4, "攻打据点", 2, 7000, 7, "15,15010,1", "攻打1次白马之围上副本文丑据点", "15|0|100,16|0|100,1|0|22500", 10, "head_lidian.png", "quan_jiang_lidian.png", "快去讨伐白马之围上的文丑！", 4, 0, 0, },
	id_4015 = {4015, 4, "攻打据点", 2, 7000, 7, "16,16010,1", "攻打1次白马之围下副本许攸据点", "15|0|100,16|0|100,1|0|22500", 10, "head_zhugejin.png", "quan_jiang_zhugejin.png", "快去讨伐白马之围下的许攸！", 4, 0, 0, },
	id_4016 = {4016, 4, "攻打据点", 2, 7000, 8, "17,17010,1", "攻打1次千里走单骑上副本卞喜据点", "15|0|100,16|0|100,1|0|22500", 10, "head_liubiao.png", "quan_jiang_liubiao.png", "快去讨伐千里走单骑上的卞喜！", 4, 0, 0, },
	id_4017 = {4017, 4, "攻打据点", 2, 7000, 8, "18,18010,1", "攻打1次千里走单骑下副本夏侯惇据点", "15|0|100,16|0|100,1|0|22500", 10, "head_zhangbao.png", "quan_jiang_zhangbao.png", "快去讨伐千里走单骑下的夏侯惇！", 4, 0, 0, },
	id_4018 = {4018, 4, "攻打据点", 2, 7000, 9, "19,19010,1", "攻打1次官渡之战上副本淳于琼据点", "15|0|100,16|0|100,1|0|22500", 10, "head_lukang.png", "quan_jiang_lukang.png", "快去讨伐官渡之战上的淳于琼！", 4, 0, 0, },
	id_4019 = {4019, 4, "攻打据点", 2, 7000, 9, "20,20010,1", "攻打1次官渡之战下副本袁绍据点", "15|0|100,16|0|100,1|0|22500", 10, "head_xinxianying.png", "quan_jiang_xinxianying.png", "快去讨伐官渡之战下的袁绍！", 4, 0, 0, },
	id_4020 = {4020, 4, "攻打据点", 2, 7000, 10, "21,21010,1", "攻打1次荆州之战上副本鲁肃据点", "15|0|100,16|0|100,1|0|22500", 10, "head_wenpin.png", "quan_jiang_wenpin.png", "快去讨伐荆州之战上的鲁肃！", 4, 0, 0, },
	id_4021 = {4021, 4, "攻打据点", 2, 7000, 10, "22,22010,1", "攻打1次荆州之战中副本刘琮据点", "15|0|100,16|0|100,1|0|22500", 10, "head_xinxianying.png", "quan_jiang_xinxianying.png", "快去讨伐荆州之战中的刘琮！", 4, 0, 0, },
	id_4022 = {4022, 4, "攻打据点", 2, 7000, 11, "23,23010,1", "攻打1次荆州之战下副本蔡瑁据点", "15|0|100,16|0|100,1|0|22500", 10, "head_liubiao.png", "quan_jiang_liubiao.png", "快去讨伐荆州之战下的蔡瑁！", 4, 0, 0, },
	id_4023 = {4023, 4, "攻打据点", 2, 7000, 11, "24,24010,1", "攻打1次江东破众将上副本吕蒙据点", "15|0|100,16|0|100,1|0|22500", 10, "head_xunyou.png", "quan_jiang_xunyou.png", "快去讨伐江东破众将上的吕蒙！", 4, 0, 0, },
	id_4024 = {4024, 4, "攻打据点", 2, 7000, 12, "25,25010,1", "攻打1次江东破众将中副本潘璋据点", "15|0|100,16|0|100,1|0|22500", 10, "head_manchong.png", "quan_jiang_manchong.png", "快去讨伐江东破众将中的潘璋！", 4, 0, 0, },
	id_4025 = {4025, 4, "攻打据点", 2, 7000, 12, "26,26010,1", "攻打1次江东破众将下副本甘宁据点", "15|0|100,16|0|100,1|0|22500", 10, "head_xinxianying.png", "quan_jiang_xinxianying.png", "快去讨伐江东破众将下的甘宁！", 4, 0, 0, },
	id_4026 = {4026, 4, "攻打据点", 3, 3125, 13, "26,26010,2", "攻打2次江东破众将下副本甘宁据点", "15|0|200,16|0|200,1|0|30000", 20, "head_weiyan.png", "quan_jiang_weiyan.png", "快去讨伐江东破众将下的甘宁！", 4, 0, 0, },
	id_4027 = {4027, 4, "攻打据点", 3, 3125, 13, "27,27010,2", "攻打2次江州魔阵上副本太史慈据点", "15|0|200,16|0|200,1|0|30000", 20, "head_gaoshun.png", "quan_jiang_gaoshun.png", "快去讨伐江州魔阵上的太史慈！", 4, 0, 0, },
	id_4028 = {4028, 4, "攻打据点", 3, 3125, 14, "28,28010,2", "攻打2次江州魔阵中副本朱异据点", "15|0|200,16|0|200,1|0|30000", 20, "head_huanggai.png", "quan_jiang_huanggai.png", "快去讨伐江州魔阵中的朱异！", 4, 0, 0, },
	id_4029 = {4029, 4, "攻打据点", 3, 3125, 14, "29,29010,2", "攻打2次江州魔阵下副本黄盖据点", "15|0|200,16|0|200,1|0|30000", 20, "head_chengong.png", "quan_jiang_chengong.png", "快去讨伐江州魔阵下的黄盖！", 4, 0, 0, },
	id_4030 = {4030, 4, "攻打据点", 3, 3125, 15, "30,30010,2", "攻打2次新野漉战上副本李典据点", "15|0|200,16|0|200,1|0|30000", 20, "head_menghuo.png", "quan_jiang_menghuo.png", "快去讨伐新野漉战上的李典！", 4, 0, 0, },
	id_4031 = {4031, 4, "攻打据点", 3, 3125, 15, "31,31010,2", "攻打2次新野漉战中副本张颌据点", "15|0|200,16|0|200,1|0|30000", 20, "head_lejin.png", "quan_jiang_lejin.png", "快去讨伐新野漉战中的张颌！", 4, 0, 0, },
	id_4032 = {4032, 4, "攻打据点", 3, 3125, 16, "32,32010,2", "攻打2次新野漉战下副本夏侯渊据点", "15|0|200,16|0|200,1|0|30000", 20, "head_zhurong.png", "quan_jiang_zhurong.png", "快去讨伐新野漉战下的夏侯渊！", 4, 0, 0, },
	id_4033 = {4033, 4, "攻打据点", 3, 3125, 16, "33,33010,2", "攻打2次火烧博望坡上副本许褚据点", "15|0|200,16|0|200,1|0|30000", 20, "head_sunjian.png", "quan_jiang_sunjian.png", "快去讨伐火烧博望坡上的许褚！", 4, 0, 0, },
	id_4034 = {4034, 4, "攻打据点", 3, 3125, 17, "34,34010,2", "攻打2次火烧博望坡中副本李典据点", "15|0|200,16|0|200,1|0|30000", 20, "head_huangzhong.png", "quan_jiang_huangzhong.png", "快去讨伐火烧博望坡中的李典！", 4, 0, 0, },
	id_4035 = {4035, 4, "攻打据点", 3, 3125, 17, "34,34010,3", "攻打3次火烧博望坡中副本李典据点", "15|0|200,16|0|200,1|0|30000", 20, "head_sunquan.png", "quan_jiang_sunquan.png", "快去讨伐火烧博望坡中的李典！", 4, 0, 0, },
	id_4036 = {4036, 4, "攻打据点", 3, 3125, 18, "35,35010,2", "攻打2次火烧博望坡下副本夏侯惇据点", "15|0|200,16|0|200,1|0|30000", 20, "head_wenchou.png", "quan_jiang_wenchou.png", "快去讨伐火烧博望坡下的夏侯惇！", 4, 0, 0, },
	id_4037 = {4037, 4, "攻打据点", 4, 1000, 18, "36,36010,2", "攻打2次荆州献曹上副本蔡瑁据点", "15|0|400,16|0|400,1|0|45000", 20, "head_zhoutai.png", "quan_jiang_zhoutai.png", "快去讨伐荆州献曹上的蔡瑁！", 4, 0, 0, },
	id_4038 = {4038, 4, "攻打据点", 4, 1000, 19, "37,37010,2", "攻打2次荆州献曹中副本曹仁据点", "15|0|400,16|0|400,1|0|45000", 20, "head_menghuo.png", "quan_jiang_menghuo.png", "快去讨伐荆州献曹中的曹仁！", 4, 0, 0, },
	id_4039 = {4039, 4, "攻打据点", 4, 1000, 19, "38,38010,2", "攻打2次荆州献曹下副本曹操据点", "15|0|400,16|0|400,1|0|45000", 20, "head_sunquan.png", "quan_jiang_sunquan.png", "快去讨伐荆州献曹下的曹操！", 4, 0, 0, },
	id_4040 = {4040, 4, "攻打据点", 4, 1000, 20, "37,37010,2", "攻打2次荆州献曹中副本曹仁据点", "15|0|400,16|0|400,1|0|45000", 20, "head_daqiao.png", "quan_jiang_daqiao.png", "快去讨伐荆州献曹中的曹仁！", 4, 0, 0, },
	id_4041 = {4041, 4, "攻打据点", 4, 1000, 20, "38,38010,2", "攻打2次荆州献曹下副本曹操据点", "15|0|400,16|0|400,1|0|45000", 20, "head_zhenji.png", "quan_jiang_zhenji.png", "快去讨伐荆州献曹下的曹操！", 4, 0, 0, },
	id_4042 = {4042, 4, "攻打据点", 5, 468, 20, "39,39010,3", "攻打3次火烧新野上副本曹洪据点", "15|0|800,16|0|800,1|0|60000", 30, "head_huatuo.png", "quan_jiang_huatuo.png", "快去讨伐火烧新野上的曹洪！", 4, 0, 0, },
	id_4043 = {4043, 4, "攻打据点", 5, 468, 20, "40,40010,3", "攻打3次火烧新野中副本曹仁据点", "15|0|800,16|0|800,1|0|60000", 30, "head_machao.png", "quan_jiang_machao.png", "快去讨伐火烧新野中的曹仁！", 4, 0, 0, },
	id_4044 = {4044, 4, "攻打据点", 5, 468, 20, "41,41010,3", "攻打3次火烧新野下副本许褚据点", "15|0|800,16|0|800,1|0|60000", 30, "head_huatuo.png", "quan_jiang_huatuo.png", "快去讨伐火烧新野下的许褚！", 4, 0, 0, },
	id_4045 = {4045, 4, "攻打据点", 3, 3125, 7, "15,15010,4", "攻打4次白马之围上副本文丑据点", "15|0|200,16|0|200,1|0|30000", 20, "head_weiyan.png", "quan_jiang_weiyan.png", "快去讨伐白马之围上的文丑！", 4, 0, 0, },
	id_4046 = {4046, 4, "攻打据点", 3, 3125, 7, "16,16010,4", "攻打4次白马之围下副本许攸据点", "15|0|200,16|0|200,1|0|30000", 20, "head_gaoshun.png", "quan_jiang_gaoshun.png", "快去讨伐白马之围下的许攸！", 4, 0, 0, },
	id_4047 = {4047, 4, "攻打据点", 3, 3125, 8, "17,17010,4", "攻打4次千里走单骑上副本卞喜据点", "15|0|200,16|0|200,1|0|30000", 20, "head_huanggai.png", "quan_jiang_huanggai.png", "快去讨伐千里走单骑上的卞喜！", 4, 0, 0, },
	id_4048 = {4048, 4, "攻打据点", 3, 3125, 8, "18,18010,4", "攻打4次千里走单骑下副本夏侯惇据点", "15|0|200,16|0|200,1|0|30000", 20, "head_chengong.png", "quan_jiang_chengong.png", "快去讨伐千里走单骑下的夏侯惇！", 4, 0, 0, },
	id_4049 = {4049, 4, "攻打据点", 3, 3125, 9, "19,19010,4", "攻打4次官渡之战上副本淳于琼据点", "15|0|200,16|0|200,1|0|30000", 20, "head_menghuo.png", "quan_jiang_menghuo.png", "快去讨伐官渡之战上的淳于琼！", 4, 0, 0, },
	id_4050 = {4050, 4, "攻打据点", 3, 3125, 9, "20,20010,4", "攻打4次官渡之战下副本袁绍据点", "15|0|200,16|0|200,1|0|30000", 20, "head_lejin.png", "quan_jiang_lejin.png", "快去讨伐官渡之战下的袁绍！", 4, 0, 0, },
	id_4051 = {4051, 4, "攻打据点", 3, 3125, 10, "21,21010,4", "攻打4次荆州之战上副本鲁肃据点", "15|0|200,16|0|200,1|0|30000", 20, "head_zhurong.png", "quan_jiang_zhurong.png", "快去讨伐荆州之战上的鲁肃！", 4, 0, 0, },
	id_4052 = {4052, 4, "攻打据点", 3, 3125, 10, "22,22010,3", "攻打3次荆州之战中副本刘琮据点", "15|0|200,16|0|200,1|0|30000", 20, "head_sunjian.png", "quan_jiang_sunjian.png", "快去讨伐荆州之战中的刘琮！", 4, 0, 0, },
	id_4053 = {4053, 4, "攻打据点", 3, 3125, 11, "23,23010,3", "攻打3次荆州之战下副本蔡瑁据点", "15|0|200,16|0|200,1|0|30000", 20, "head_huangzhong.png", "quan_jiang_huangzhong.png", "快去讨伐荆州之战下的蔡瑁！", 4, 0, 0, },
	id_4054 = {4054, 4, "攻打据点", 3, 3125, 11, "24,24010,3", "攻打3次江东破众将上副本吕蒙据点", "15|0|200,16|0|200,1|0|30000", 20, "head_sunquan.png", "quan_jiang_sunquan.png", "快去讨伐江东破众将上的吕蒙！", 4, 0, 0, },
	id_4055 = {4055, 4, "攻打据点", 3, 3125, 12, "25,25010,3", "攻打3次江东破众将中副本潘璋据点", "15|0|200,16|0|200,1|0|30000", 20, "head_wenchou.png", "quan_jiang_wenchou.png", "快去讨伐江东破众将中的潘璋！", 4, 0, 0, },
	id_4056 = {4056, 4, "攻打据点", 4, 1000, 8, "17,17010,6", "攻打6次千里走单骑上副本卞喜据点", "15|0|400,16|0|400,1|0|45000", 20, "head_zhoutai.png", "quan_jiang_zhoutai.png", "快去讨伐千里走单骑上的卞喜！", 4, 0, 0, },
	id_4057 = {4057, 4, "攻打据点", 4, 1000, 8, "18,18010,6", "攻打6次千里走单骑下副本夏侯惇据点", "15|0|400,16|0|400,1|0|45000", 20, "head_menghuo.png", "quan_jiang_menghuo.png", "快去讨伐千里走单骑下的夏侯惇！", 4, 0, 0, },
	id_4058 = {4058, 4, "攻打据点", 4, 1000, 9, "19,19010,6", "攻打6次官渡之战上副本淳于琼据点", "15|0|400,16|0|400,1|0|45000", 20, "head_sunquan.png", "quan_jiang_sunquan.png", "快去讨伐官渡之战上的淳于琼！", 4, 0, 0, },
	id_4059 = {4059, 4, "攻打据点", 4, 1000, 9, "20,20010,6", "攻打6次官渡之战下副本袁绍据点", "15|0|400,16|0|400,1|0|45000", 20, "head_daqiao.png", "quan_jiang_daqiao.png", "快去讨伐官渡之战下的袁绍！", 4, 0, 0, },
	id_4060 = {4060, 4, "攻打据点", 4, 1000, 10, "21,21010,5", "攻打5次荆州之战上副本鲁肃据点", "15|0|400,16|0|400,1|0|45000", 20, "head_zhenji.png", "quan_jiang_zhenji.png", "快去讨伐荆州之战上的鲁肃！", 4, 0, 0, },
	id_4061 = {4061, 4, "攻打据点", 4, 1000, 10, "22,22010,5", "攻打5次荆州之战中副本刘琮据点", "15|0|400,16|0|400,1|0|45000", 20, "head_zhoutai.png", "quan_jiang_zhoutai.png", "快去讨伐荆州之战中的刘琮！", 4, 0, 0, },
	id_4062 = {4062, 4, "攻打据点", 4, 1000, 11, "23,23010,5", "攻打5次荆州之战下副本蔡瑁据点", "15|0|400,16|0|400,1|0|45000", 20, "head_menghuo.png", "quan_jiang_menghuo.png", "快去讨伐荆州之战下的蔡瑁！", 4, 0, 0, },
	id_4063 = {4063, 4, "攻打据点", 4, 1000, 11, "24,24010,5", "攻打5次江东破众将上副本吕蒙据点", "15|0|400,16|0|400,1|0|45000", 20, "head_sunquan.png", "quan_jiang_sunquan.png", "快去讨伐江东破众将上的吕蒙！", 4, 0, 0, },
	id_4064 = {4064, 4, "攻打据点", 4, 1000, 12, "25,25010,5", "攻打5次江东破众将中副本潘璋据点", "15|0|400,16|0|400,1|0|45000", 20, "head_daqiao.png", "quan_jiang_daqiao.png", "快去讨伐江东破众将中的潘璋！", 4, 0, 0, },
	id_4065 = {4065, 4, "攻打据点", 4, 1000, 12, "26,26010,5", "攻打5次江东破众将下副本甘宁据点", "15|0|400,16|0|400,1|0|45000", 20, "head_zhenji.png", "quan_jiang_zhenji.png", "快去讨伐江东破众将下的甘宁！", 4, 0, 0, },
	id_4066 = {4066, 4, "攻打据点", 4, 1000, 13, "27,27010,4", "攻打4次江州魔阵上副本太史慈据点", "15|0|400,16|0|400,1|0|45000", 20, "head_zhoutai.png", "quan_jiang_zhoutai.png", "快去讨伐江州魔阵上的太史慈！", 4, 0, 0, },
	id_4067 = {4067, 4, "攻打据点", 4, 1000, 13, "28,28010,4", "攻打4次江州魔阵中副本朱异据点", "15|0|400,16|0|400,1|0|45000", 20, "head_menghuo.png", "quan_jiang_menghuo.png", "快去讨伐江州魔阵中的朱异！", 4, 0, 0, },
	id_4068 = {4068, 4, "攻打据点", 4, 1000, 14, "29,29010,4", "攻打4次江州魔阵下副本黄盖据点", "15|0|400,16|0|400,1|0|45000", 20, "head_sunquan.png", "quan_jiang_sunquan.png", "快去讨伐江州魔阵下的黄盖！", 4, 0, 0, },
	id_4069 = {4069, 4, "攻打据点", 4, 1000, 14, "30,30010,4", "攻打4次新野漉战上副本李典据点", "15|0|400,16|0|400,1|0|45000", 20, "head_daqiao.png", "quan_jiang_daqiao.png", "快去讨伐新野漉战上的李典！", 4, 0, 0, },
	id_4070 = {4070, 4, "攻打据点", 4, 1000, 15, "31,31010,4", "攻打4次新野漉战中副本张颌据点", "15|0|400,16|0|400,1|0|45000", 20, "head_zhenji.png", "quan_jiang_zhenji.png", "快去讨伐新野漉战中的张颌！", 4, 0, 0, },
	id_4071 = {4071, 4, "攻打据点", 4, 1000, 15, "32,32010,3", "攻打3次新野漉战下副本夏侯渊据点", "15|0|400,16|0|400,1|0|45000", 20, "head_zhoutai.png", "quan_jiang_zhoutai.png", "快去讨伐新野漉战下的夏侯渊！", 4, 0, 0, },
	id_4072 = {4072, 4, "攻打据点", 4, 1000, 16, "33,33010,3", "攻打3次火烧博望坡上副本许褚据点", "15|0|400,16|0|400,1|0|45000", 20, "head_menghuo.png", "quan_jiang_menghuo.png", "快去讨伐火烧博望坡上的许褚！", 4, 0, 0, },
	id_4073 = {4073, 4, "攻打据点", 4, 1000, 16, "34,34010,4", "攻打4次火烧博望坡中副本李典据点", "15|0|400,16|0|400,1|0|45000", 20, "head_sunquan.png", "quan_jiang_sunquan.png", "快去讨伐火烧博望坡中的李典！", 4, 0, 0, },
	id_4074 = {4074, 4, "攻打据点", 4, 1000, 17, "34,34010,3", "攻打3次火烧博望坡中副本李典据点", "15|0|400,16|0|400,1|0|45000", 20, "head_daqiao.png", "quan_jiang_daqiao.png", "快去讨伐火烧博望坡中的李典！", 4, 0, 0, },
	id_4075 = {4075, 4, "攻打据点", 4, 1000, 18, "35,35010,3", "攻打3次火烧博望坡下副本夏侯惇据点", "15|0|400,16|0|400,1|0|45000", 20, "head_zhenji.png", "quan_jiang_zhenji.png", "快去讨伐火烧博望坡下的夏侯惇！", 4, 0, 0, },
	id_4076 = {4076, 4, "攻打据点", 5, 468, 10, "21,21010,8", "攻打8次荆州之战上副本鲁肃据点", "15|0|800,16|0|800,1|0|60000", 30, "head_huatuo.png", "quan_jiang_huatuo.png", "快去讨伐荆州之战上的鲁肃！", 4, 0, 0, },
	id_4077 = {4077, 4, "攻打据点", 5, 468, 10, "22,22010,8", "攻打8次荆州之战中副本刘琮据点", "15|0|800,16|0|800,1|0|60000", 30, "head_machao.png", "quan_jiang_machao.png", "快去讨伐荆州之战中的刘琮！", 4, 0, 0, },
	id_4078 = {4078, 4, "攻打据点", 5, 468, 11, "23,23010,8", "攻打8次荆州之战下副本蔡瑁据点", "15|0|800,16|0|800,1|0|60000", 30, "head_huatuo.png", "quan_jiang_huatuo.png", "快去讨伐荆州之战下的蔡瑁！", 4, 0, 0, },
	id_4079 = {4079, 4, "攻打据点", 5, 468, 11, "24,24010,8", "攻打8次江东破众将上副本吕蒙据点", "15|0|800,16|0|800,1|0|60000", 30, "head_huatuo.png", "quan_jiang_huatuo.png", "快去讨伐江东破众将上的吕蒙！", 4, 0, 0, },
	id_4080 = {4080, 4, "攻打据点", 5, 468, 12, "25,25010,8", "攻打8次江东破众将中副本潘璋据点", "15|0|800,16|0|800,1|0|60000", 30, "head_machao.png", "quan_jiang_machao.png", "快去讨伐江东破众将中的潘璋！", 4, 0, 0, },
	id_4081 = {4081, 4, "攻打据点", 5, 468, 12, "26,26010,8", "攻打8次江东破众将下副本甘宁据点", "15|0|800,16|0|800,1|0|60000", 30, "head_huatuo.png", "quan_jiang_huatuo.png", "快去讨伐江东破众将下的甘宁！", 4, 0, 0, },
	id_4082 = {4082, 4, "攻打据点", 5, 468, 10, "22,22010,6", "攻打6次荆州之战中副本刘琮据点", "15|0|800,16|0|800,1|0|60000", 30, "head_huatuo.png", "quan_jiang_huatuo.png", "快去讨伐荆州之战中的刘琮！", 4, 0, 0, },
	id_4083 = {4083, 4, "攻打据点", 5, 468, 11, "23,23010,6", "攻打6次荆州之战下副本蔡瑁据点", "15|0|800,16|0|800,1|0|60000", 30, "head_machao.png", "quan_jiang_machao.png", "快去讨伐荆州之战下的蔡瑁！", 4, 0, 0, },
	id_4084 = {4084, 4, "攻打据点", 5, 468, 11, "24,24010,6", "攻打6次江东破众将上副本吕蒙据点", "15|0|800,16|0|800,1|0|60000", 30, "head_huatuo.png", "quan_jiang_huatuo.png", "快去讨伐江东破众将上的吕蒙！", 4, 0, 0, },
	id_4085 = {4085, 4, "攻打据点", 5, 468, 12, "25,25010,6", "攻打6次江东破众将中副本潘璋据点", "15|0|800,16|0|800,1|0|60000", 30, "head_huatuo.png", "quan_jiang_huatuo.png", "快去讨伐江东破众将中的潘璋！", 4, 0, 0, },
	id_4086 = {4086, 4, "攻打据点", 5, 468, 12, "26,26010,6", "攻打6次江东破众将下副本甘宁据点", "15|0|800,16|0|800,1|0|60000", 30, "head_machao.png", "quan_jiang_machao.png", "快去讨伐江东破众将下的甘宁！", 4, 0, 0, },
	id_4087 = {4087, 4, "攻打据点", 5, 468, 13, "27,27010,5", "攻打5次江州魔阵上副本太史慈据点", "15|0|800,16|0|800,1|0|60000", 30, "head_huatuo.png", "quan_jiang_huatuo.png", "快去讨伐江州魔阵上的太史慈！", 4, 0, 0, },
	id_4088 = {4088, 4, "攻打据点", 5, 468, 13, "28,28010,5", "攻打5次江州魔阵中副本朱异据点", "15|0|800,16|0|800,1|0|60000", 30, "head_huatuo.png", "quan_jiang_huatuo.png", "快去讨伐江州魔阵中的朱异！", 4, 0, 0, },
	id_4089 = {4089, 4, "攻打据点", 5, 468, 14, "29,29010,5", "攻打5次江州魔阵下副本黄盖据点", "15|0|800,16|0|800,1|0|60000", 30, "head_machao.png", "quan_jiang_machao.png", "快去讨伐江州魔阵下的黄盖！", 4, 0, 0, },
	id_4090 = {4090, 4, "攻打据点", 5, 468, 14, "30,30010,5", "攻打5次新野漉战上副本李典据点", "15|0|800,16|0|800,1|0|60000", 30, "head_huatuo.png", "quan_jiang_huatuo.png", "快去讨伐新野漉战上的李典！", 4, 0, 0, },
	id_4091 = {4091, 4, "攻打据点", 5, 468, 15, "31,31010,5", "攻打5次新野漉战中副本张颌据点", "15|0|800,16|0|800,1|0|60000", 30, "head_huatuo.png", "quan_jiang_huatuo.png", "快去讨伐新野漉战中的张颌！", 4, 0, 0, },
	id_4092 = {4092, 4, "攻打据点", 5, 468, 15, "32,32010,4", "攻打4次新野漉战下副本夏侯渊据点", "15|0|800,16|0|800,1|0|60000", 30, "head_machao.png", "quan_jiang_machao.png", "快去讨伐新野漉战下的夏侯渊！", 4, 0, 0, },
	id_4093 = {4093, 4, "攻打据点", 5, 468, 16, "33,33010,4", "攻打4次火烧博望坡上副本许褚据点", "15|0|800,16|0|800,1|0|60000", 30, "head_huatuo.png", "quan_jiang_huatuo.png", "快去讨伐火烧博望坡上的许褚！", 4, 0, 0, },
	id_4094 = {4094, 4, "攻打据点", 5, 468, 16, "34,34010,4", "攻打4次火烧博望坡中副本李典据点", "15|0|800,16|0|800,1|0|60000", 30, "head_huatuo.png", "quan_jiang_huatuo.png", "快去讨伐火烧博望坡中的李典！", 4, 0, 0, },
	id_4095 = {4095, 4, "攻打据点", 5, 468, 17, "34,34010,4", "攻打4次火烧博望坡中副本李典据点", "15|0|800,16|0|800,1|0|60000", 30, "head_machao.png", "quan_jiang_machao.png", "快去讨伐火烧博望坡中的李典！", 4, 0, 0, },
	id_4096 = {4096, 4, "攻打据点", 5, 468, 18, "35,35010,4", "攻打4次火烧博望坡下副本夏侯惇据点", "15|0|800,16|0|800,1|0|60000", 30, "head_huatuo.png", "quan_jiang_huatuo.png", "快去讨伐火烧博望坡下的夏侯惇！", 4, 0, 0, },
	id_5000 = {5000, 5, "破坏城池", 1, 27000, 5, "8,1,1", "破坏任意城池1次，本次可破坏8点城防", "15|0|50,16|0|50,1|0|17000", 10, "head_wenpin.png", "quan_jiang_wenpin.png", "今天我带你去攻个小城！", 5, 0, 5, },
	id_5001 = {5001, 5, "破坏城池", 1, 27000, 5, "8,1,1", "破坏任意城池1次，本次可破坏8点城防", "15|0|50,16|0|50,1|0|17000", 10, "head_guanyinping.png", "quan_jiang_guanyinping.png", "父亲教我的刀法可以派上用场了！", 5, 0, 5, },
	id_5002 = {5002, 5, "破坏城池", 1, 27000, 5, "8,1,1", "破坏任意城池1次，本次可破坏8点城防", "15|0|50,16|0|50,1|0|17000", 10, "head_wenpin.png", "quan_jiang_wenpin.png", "今天我带你去攻个大城！", 5, 0, 5, },
	id_5003 = {5003, 5, "破坏城池", 1, 27000, 5, "8,1,1", "破坏任意城池1次，本次可破坏8点城防", "15|0|50,16|0|50,1|0|17000", 10, "head_xunyou.png", "quan_jiang_xunyou.png", "这次的攻城战异常艰辛啊！", 5, 0, 5, },
	id_5004 = {5004, 5, "破坏城池", 2, 21000, 5, "12,1,1", "破坏任意城池1次，本次可破坏12点城防", "15|0|100,16|0|100,1|0|25500", 10, "head_guanping.png", "quan_jiang_guanping.png", "出发吧！", 5, 0, 5, },
	id_5005 = {5005, 5, "破坏城池", 2, 21000, 5, "12,1,1", "破坏任意城池1次，本次可破坏12点城防", "15|0|100,16|0|100,1|0|25500", 10, "head_chengpu.png", "quan_jiang_chengpu.png", "下令吧！主公！", 5, 0, 5, },
	id_5006 = {5006, 5, "破坏城池", 2, 21000, 5, "12,1,1", "破坏任意城池1次，本次可破坏12点城防", "15|0|100,16|0|100,1|0|25500", 10, "head_jiling.png", "quan_jiang_jiling.png", "投石车都准备好了吗？", 5, 0, 5, },
	id_5007 = {5007, 5, "破坏城池", 2, 21000, 5, "12,1,1", "破坏任意城池1次，本次可破坏12点城防", "15|0|100,16|0|100,1|0|25500", 10, "head_lukang.png", "quan_jiang_lukang.png", "这可是一场硬仗啊！", 5, 0, 5, },
	id_5008 = {5008, 5, "破坏城池", 3, 7500, 10, "15,1,1", "破坏任意城池1次，本次可破坏15点城防", "15|0|200,16|0|200,1|0|34000", 20, "head_zhurong.png", "quan_jiang_zhurong.png", "这种小村子，一把火烧了不就好了！", 5, 0, 5, },
	id_5009 = {5009, 5, "破坏城池", 3, 7500, 10, "15,1,1", "破坏任意城池1次，本次可破坏15点城防", "15|0|200,16|0|200,1|0|34000", 20, "head_lejin.png", "quan_jiang_lejin.png", "待我偷偷爬上城墙…", 5, 0, 5, },
	id_5010 = {5010, 5, "破坏城池", 3, 7500, 10, "15,1,1", "破坏任意城池1次，本次可破坏15点城防", "15|0|200,16|0|200,1|0|34000", 20, "head_yujin.png", "quan_jiang_yujin.png", "不好，被发现了！", 5, 0, 5, },
	id_5011 = {5011, 5, "破坏城池", 3, 7500, 10, "15,1,1", "破坏任意城池1次，本次可破坏15点城防", "15|0|200,16|0|200,1|0|34000", 20, "head_yanliang.png", "quan_jiang_yanliang.png", "其实比起单挑，我更善于攻城！", 5, 0, 5, },
	id_5012 = {5012, 5, "破坏城池", 4, 3000, 15, "22,1,1", "破坏任意城池1次，本次可破坏22点城防", "15|0|400,16|0|400,1|0|51000", 20, "head_sunquan.png", "quan_jiang_sunquan.png", "这种小事也要问过我？", 5, 0, 5, },
	id_5013 = {5013, 5, "破坏城池", 4, 3000, 15, "22,1,1", "破坏任意城池1次，本次可破坏22点城防", "15|0|400,16|0|400,1|0|51000", 20, "head_weiyan.png", "quan_jiang_weiyan.png", "到我立功的时候了！", 5, 0, 5, },
	id_5014 = {5014, 5, "破坏城池", 4, 3000, 15, "22,1,1", "破坏任意城池1次，本次可破坏22点城防", "15|0|400,16|0|400,1|0|51000", 20, "head_sunshangxiang.png", "quan_jiang_sunshangxiang.png", "谁说女子不如男？", 5, 0, 5, },
	id_5015 = {5015, 5, "破坏城池", 4, 3000, 15, "22,1,1", "破坏任意城池1次，本次可破坏22点城防", "15|0|400,16|0|400,1|0|51000", 20, "head_caiwenji.png", "quan_jiang_caiwenji.png", "别躲在里面不出声我知道你在家！", 5, 0, 5, },
	id_5016 = {5016, 5, "破坏城池", 5, 1500, 20, "30,1,1", "破坏任意城池1次，本次可破坏30点城防", "15|0|800,16|0|800,1|0|68000", 30, "head_xiahoudun.png", "quan_jiang_xiahoudun.png", "别躲在成后面射箭，出来啊！", 5, 0, 5, },
	id_5017 = {5017, 5, "破坏城池", 5, 1500, 20, "30,1,1", "破坏任意城池1次，本次可破坏30点城防", "15|0|800,16|0|800,1|0|68000", 30, "head_jiaxu.png", "quan_jiang_jiaxu.png", "趁现在攻城一定能胜！", 5, 0, 5, },
	id_5018 = {5018, 5, "破坏城池", 5, 1500, 20, "30,1,1", "破坏任意城池1次，本次可破坏30点城防", "15|0|800,16|0|800,1|0|68000", 30, "head_jiaxu.png", "quan_jiang_jiaxu.png", "这就叫瓮中捉鳖！", 5, 0, 5, },
	id_5019 = {5019, 5, "破坏城池", 5, 1500, 20, "30,1,1", "破坏任意城池1次，本次可破坏30点城防", "15|0|800,16|0|800,1|0|68000", 30, "head_luxun.png", "quan_jiang_luxun.png", "如此城池，该用火攻！", 5, 0, 5, },
	id_6000 = {6000, 6, "修复城池", 1, 18000, 5, "10,1,1", "修复城池1次，本次可修复10点城防", "15|0|50,16|0|50,1|0|17000", 10, "head_lidian.png", "quan_jiang_lidian.png", "西边的栅栏还没围好吧！", 5, 1, 5, },
	id_6001 = {6001, 6, "修复城池", 1, 18000, 5, "10,1,1", "修复城池1次，本次可修复10点城防", "15|0|50,16|0|50,1|0|17000", 10, "head_madai.png", "quan_jiang_madai.png", "东边的砖墙还没垒好吧！", 5, 1, 5, },
	id_6002 = {6002, 6, "修复城池", 1, 18000, 5, "10,1,1", "修复城池1次，本次可修复10点城防", "15|0|50,16|0|50,1|0|17000", 10, "head_heshi.png", "quan_jiang_heshi.png", "走，陪我上城墙慰劳慰劳将士们！", 5, 1, 5, },
	id_6003 = {6003, 6, "修复城池", 1, 18000, 5, "10,1,1", "修复城池1次，本次可修复10点城防", "15|0|50,16|0|50,1|0|17000", 10, "head_dingyuan.png", "quan_jiang_dingyuan.png", "长安若破，万劫不复啊！", 5, 1, 5, },
	id_6004 = {6004, 6, "修复城池", 2, 14000, 5, "16,1,1", "修复城池1次，本次可修复16点城防", "15|0|100,16|0|100,1|0|25500", 10, "head_guanxing.png", "quan_jiang_guanxing.png", "又是这种修栅栏的活！", 5, 1, 5, },
	id_6005 = {6005, 6, "修复城池", 2, 14000, 5, "16,1,1", "修复城池1次，本次可修复16点城防", "15|0|100,16|0|100,1|0|25500", 10, "head_lukang.png", "quan_jiang_lukang.png", "放下砖头，我就没法养你。", 5, 1, 5, },
	id_6006 = {6006, 6, "修复城池", 2, 14000, 5, "16,1,1", "修复城池1次，本次可修复16点城防", "15|0|100,16|0|100,1|0|25500", 10, "head_dingyuan.png", "quan_jiang_dingyuan.png", "站住，说你呢！偷井盖那个！", 5, 1, 5, },
	id_6007 = {6007, 6, "修复城池", 2, 14000, 5, "16,1,1", "修复城池1次，本次可修复16点城防", "15|0|100,16|0|100,1|0|25500", 10, "head_zhangchunhua.png", "quan_jiang_zhangchunhua.png", "我决定，就在这里修我的寝宫！", 5, 1, 5, },
	id_6008 = {6008, 6, "修复城池", 3, 5000, 10, "20,1,1", "修复城池1次，本次可修复20点城防", "15|0|200,16|0|200,1|0|34000", 20, "head_chengong.png", "quan_jiang_chengong.png", "蝼蚁之穴，可以溃堤！", 5, 1, 5, },
	id_6009 = {6009, 6, "修复城池", 3, 5000, 10, "20,1,1", "修复城池1次，本次可修复20点城防", "15|0|200,16|0|200,1|0|34000", 20, "head_zhangjiao.png", "quan_jiang_zhangjiao.png", "天灵灵，地灵灵！", 5, 1, 5, },
	id_6010 = {6010, 6, "修复城池", 3, 5000, 10, "20,1,1", "修复城池1次，本次可修复20点城防", "15|0|200,16|0|200,1|0|34000", 20, "head_dianwei.png", "quan_jiang_dianwei.png", "主公命我来督导城防修复！", 5, 1, 5, },
	id_6011 = {6011, 6, "修复城池", 3, 5000, 10, "20,1,1", "修复城池1次，本次可修复20点城防", "15|0|200,16|0|200,1|0|34000", 20, "head_caopei.png", "quan_jiang_caopei.png", "这都是爹爹为我打下的江山！", 5, 1, 5, },
	id_6012 = {6012, 6, "修复城池", 4, 2000, 15, "30,1,1", "修复城池1次，本次可修复30点城防", "15|0|400,16|0|400,1|0|51000", 20, "head_zhanghe.png", "quan_jiang_zhanghe.png", "哎，穷乡僻壤。", 5, 1, 5, },
	id_6013 = {6013, 6, "修复城池", 4, 2000, 15, "30,1,1", "修复城池1次，本次可修复30点城防", "15|0|400,16|0|400,1|0|51000", 20, "head_caiwenji.png", "quan_jiang_caiwenji.png", "嘘，别告诉他们我在家。", 5, 1, 5, },
	id_6014 = {6014, 6, "修复城池", 4, 2000, 15, "30,1,1", "修复城池1次，本次可修复30点城防", "15|0|400,16|0|400,1|0|51000", 20, "head_xusheng.png", "quan_jiang_xusheng.png", "最近敌人的攻势越来越强了。", 5, 1, 5, },
	id_6015 = {6015, 6, "修复城池", 4, 2000, 15, "30,1,1", "修复城池1次，本次可修复30点城防", "15|0|400,16|0|400,1|0|51000", 20, "head_zhenji.png", "quan_jiang_zhenji.png", "我家的城墙坏了，快来帮我修修嘛！", 5, 1, 5, },
	id_6016 = {6016, 6, "修复城池", 5, 1000, 20, "40,1,1", "修复城池1次，本次可修复40点城防", "15|0|800,16|0|800,1|0|68000", 30, "head_zhangliao.png", "quan_jiang_zhangliao.png", "小意思！", 5, 1, 5, },
	id_6017 = {6017, 6, "修复城池", 5, 1000, 20, "40,1,1", "修复城池1次，本次可修复40点城防", "15|0|800,16|0|800,1|0|68000", 30, "head_xiahoudun.png", "quan_jiang_xiahoudun.png", "修不好就别回来见我了！", 5, 1, 5, },
	id_6018 = {6018, 6, "修复城池", 5, 1000, 20, "40,1,1", "修复城池1次，本次可修复40点城防", "15|0|800,16|0|800,1|0|68000", 30, "head_lvbu.png", "quan_jiang_lvbu.png", "这种事情，你们去搞定吧！", 5, 1, 5, },
	id_6019 = {6019, 6, "修复城池", 5, 1000, 20, "40,1,1", "修复城池1次，本次可修复40点城防", "15|0|800,16|0|800,1|0|68000", 30, "head_sunce.png", "quan_jiang_sunce.png", "这可是我们最重要的根据地了！", 5, 1, 5, },
}

local mt = {}
mt.__index = function (table, key)
	for i = 1, #keys do
		if (keys[i] == key) then
			return table[i]
		end
	end
end

function getDataById(key_id)
	local id_data = Corps_quest["id_" .. key_id]
	if id_data == nil then
		print("don't find data by id " .. key_id)
		return nil
	end
	if getmetatable(id_data) ~= nil then
		return id_data
	end
	setmetatable(id_data, mt)

	return id_data
end

function getArrDataByField(fieldName, fieldValue)
	local arrData = {}
	local fieldNo = 1
	for i=1, #keys do
		if keys[i] == fieldName then
			fieldNo = i
			break
		end
	end
	for k, v in pairs(Corps_quest) do
		if v[fieldNo] == fieldValue then
			setmetatable (v, mt)
			arrData[#arrData+1] = v
		end
	end

	return arrData
end

function release()
	_G["DB_Corps_quest"] = nil
	package.loaded["DB_Corps_quest"] = nil
	package.loaded["db/DB_Corps_quest"] = nil
end

