-- Filename: DB_Explore_long_answer.lua
-- Author: auto-created by XmlToScript tool.
-- Function: it`s auto-created by XmlToScript tool.

module("DB_Explore_long_answer", package.seeall)

keys = {
	"id", "questions", "answerA", "answerB", "true", 
}

Explore_long_answer = {
	id_1 = {1, "汉灵帝即位后，宦官谁弄权？", "张让", "曹节", "2", },
	id_2 = {2, "《太平要术》是南华老仙送给谁的三卷天书？", "张宝", "张角", "2", },
	id_3 = {3, "“地公将军”是指谁？", "张角", "张宝", "2", },
	id_4 = {4, "关羽的美髯有多长？", "一尺", "二尺", "2", },
	id_5 = {5, "桃园三结义的时候，除了用马做祭祀物品外，还用了什么牛做祭祀品？", "黄牛", "黑牛", "2", },
	id_6 = {6, "“吉利”是谁的小名？", "曹操", "孙策", "1", },
	id_7 = {7, "张宝被刘备射中何部位？", "左臂", "左腿", "1", },
	id_8 = {8, "直言曹操是“治世之能臣，乱世之奸雄”的是谁？", "许劭", "何颙", "1", },
	id_9 = {9, "“人情势利古犹今，谁识英雄是白身”这句话指的是谁？", "刘备", "曹操", "1", },
	id_10 = {10, "以下何人作法大败刘备？", "张角", "张宝", "2", },
	id_11 = {11, "张飞鞭打督邮用的是什么工具？", "马鞭", "柳条", "2", },
	id_12 = {12, "刘备听从了关羽的劝说，将印绶放在何处，宣告辞职？", "放于督邮手中", "挂在督邮脖子上", "2", },
	id_13 = {13, "汉灵帝之母是谁？", "王美人", "董太后", "2", },
	id_14 = {14, "谁进言何进应该先立君位？", "袁绍", "曹操", "2", },
	id_15 = {15, "“乱天下者，必何进也”是谁的断言？", "曹操", "刘备", "1", },
	id_16 = {16, "赤兔马从蹿至项高多少？", "八尺", "七尺", "1", },
	id_17 = {17, "曹操行刺董卓不成，逃出城外，被陈宫手下所获，起初谎称自己姓什么？", "皇甫", "夏侯", "1", },
	id_18 = {18, "“七星宝刀”是谁献给董卓的？", "曹操", "王允", "1", },
	id_19 = {19, "“宁教我负天下人，休教天下人负我”曹操的这句“名言”是对谁说的？", "陈宫", "吕伯奢", "1", },
	id_20 = {20, "曹操因猜疑心重，杀了吕伯奢一家共多少人？", "八", "九", "2", },
	id_21 = {21, "袁绍被众人推选为讨伐军盟主，谁请缨当先锋？", "刘备", "孙坚", "2", },
	id_22 = {22, "以下谁急于抢功抄小路作先锋反被华雄斩于马下？", "鲍信", "鲍忠", "2", },
	id_23 = {23, "华雄躲过了孙坚射来的几支箭？", "一", "二", "2", },
	id_24 = {24, "孙坚的头巾被华雄部所获用长竿挑出进行羞辱，孙坚的头巾是什么颜色的？", "黄色", "红色", "2", },
	id_25 = {25, "身高九尺的关羽相当于现在的几米？", "2.03", "1.98", "1", },
	id_26 = {26, "哪路诸侯最先到达虎牢关与吕布交锋？", "王匡", "孔融", "1", },
	id_27 = {27, "嘲笑吕布是“三姓家奴”的是谁？", "张飞", "关羽", "1", },
	id_28 = {28, "谁救了被徐荣射中的曹操？", "曹洪", "夏侯惇", "1", },
	id_29 = {29, "是谁告诉孙坚这传国玉玺的来龙去脉的？", "程普", "韩当", "1", },
	id_30 = {30, "赵云一出场便救了谁？", "袁绍", "公孙瓒", "2", },
	id_31 = {31, "马超十七岁刚出道时，刺死的第一人是谁？", "李蒙", "王方", "2", },
	id_32 = {32, "典韦的铁戟重多少斤？", "八十二", "八十", "2", },
	id_33 = {33, "路遇火德星君扮的美人，能做到目不邪视的是谁？", "陈登", "孔融", "2", },
	id_34 = {34, "孔融是“孔子”的第几代世孙？", "二十五", "二十", "2", },
	id_35 = {35, "刘备率部来救徐州，与曹军何部先交上了火？", "曹洪", "于禁", "2", },
	id_36 = {36, "在长安城中，帮吕布私藏妻小的是谁？", "张超", "庞舒", "2", },
	id_37 = {37, "曹军偷袭吕布营寨，以下哪两人联手敌不过吕布？", "于禁乐进", "典韦李典", "1", },
	id_38 = {38, "曹操差点被吕布认出擒获，急中生智地指出骑何色马者是曹操？", "黄", "红", "1", },
	id_39 = {39, "曹操称赞谁是当今的“樊哙”？", "许褚", "典韦", "1", },
	id_40 = {40, "建议曹操迁都许都的是谁？", "董昭", "程昱", "1", },
	id_41 = {41, "孙策将传国玉玺作为抵押物，才向袁术借得多少兵？", "三千", "五千", "1", },
	id_42 = {42, "孙策与太史慈扭打滚到地上后，孙策手快拿了太史慈的什么东西？", "短戟", "头盔", "1", },
	id_43 = {43, "“孙郎”是指谁？", "孙坚", "孙策", "2", },
	id_44 = {44, "以下周泰为救孙权，身中多少枪？", "十", "十二", "2", },
	id_45 = {45, "吕布辕门射戟的距离是多少？", "一百步", "一百五十步", "2", },
	id_46 = {46, "谁劝张绣投降曹操的？", "荀彧", "贾诩", "2", },
	id_47 = {47, "在宛城，给曹操介绍美女邹氏的是谁？", "曹丕", "曹安民", "2", },
	id_48 = {48, "以下谁因为治兵不严受到曹操的惩罚？", "夏侯惇", "乐进", "1", },
	id_49 = {49, "骂吕布是“背主家奴”的是谁？", "袁术", "纪灵", "1", },
	id_50 = {50, "曹操粮草吃紧，将谁推出当替死鬼以稳定军心？", "王垕", "梁刚", "1", },
	id_51 = {51, "曹操马踏麦田，欲装模作样自刎，郭嘉以何书上的“法不加于尊”劝慰曹操？", "《春秋》", "《左传》", "1", },
	id_52 = {52, "曹操攻城被贾诩识破后折兵五万，另有哪两大将受伤？", "吕虔于禁", "李典许褚", "1", },
	id_53 = {53, "“十胜十败说”是谁的理论？", "荀彧", "郭嘉", "2", },
	id_54 = {54, "夏侯惇的左眼是被谁射中的？", "高顺", "曹性", "2", },
	id_55 = {55, "吕布自恃粮食充足，准备死守何处？", "徐州", "下邳", "2", },
	id_56 = {56, "陈宫在城头上偷袭曹操，射中其何部位？", "左肩", "头盔", "2", },
	id_57 = {57, "见攻城两月未下后，谁建议放水淹城困死吕布？", "荀彧", "郭嘉", "2", },
	id_58 = {58, "曹操采纳了谋士的建议后，决堤放了哪两河之水？", "沂、泗", "泾、渭", "1", },
	id_59 = {59, "“生死无二志，丈夫何壮哉”是称赞谁的？", "陈宫", "丁管", "1", },
	id_60 = {60, "献帝给董承的血诏上写着是建安几年？", "四", "六", "1", },
	id_61 = {61, "袁绍“四世三公”出身，东汉时的“三公”是指除外以下哪项？", "司马", "司徒", "1", },
	id_62 = {62, "刘备是被曹操手下哪两位请去饮酒品青梅？", "许褚张辽", "李典乐进", "1", },
	id_63 = {63, "关于刘备来讨救兵抗曹，以下谁对袁绍不采用自己的计谋非常不满？", "沮授", "田丰", "1", },
	id_64 = {64, "袁绍因为小儿子生什么病，所以无心论国事？", "麻疹", "疥疮", "2", },
	id_65 = {65, "以下谁献计截了关羽后路，然后再进行劝降？", "张辽", "程昱", "2", },
	id_66 = {66, "关羽的“美髯公”之称最早是由谁叫起的？", "曹操", "汉献帝", "2", },
	id_67 = {67, "曹军中哪员大将不敌颜良后，曹军诸将皆骇然？", "许褚", "徐晃", "2", },
	id_68 = {68, "文丑一箭射中何人的头盔？", "徐晃", "张辽", "2", },
	id_69 = {69, "张辽战马被文丑射死，是谁来救的他？", "曹仁", "徐晃", "2", },
	id_70 = {70, "关羽过五关时杀的第一将是谁？", "孔秀", "韩福", "1", },
	id_71 = {71, "关羽过五关时，能够挡住关羽一回合的是何将？", "孟坦", "孔秀", "1", },
	id_72 = {72, "关羽过五关时，汜水关镇国寺何僧与关羽是同乡？", "普净", "虚空", "1", },
	id_73 = {73, "关羽过五关时，被何人一箭射中左臂？", "韩福", "王植", "1", },
	id_74 = {74, "关羽过五关时，何人是洛阳太守？", "韩福", "王植", "1", },
	id_75 = {75, "刘备在袁绍面前将颜良和文丑比作什么？", "鹿", "狼", "1", },
	id_76 = {76, "赵云在何处正式投入到刘备手下？", "古城", "卧牛山", "2", },
	id_77 = {77, "于吉是何方的道士？", "紫虚观", "琅琊宫", "2", },
	id_78 = {78, "孙策要斩于吉，谁最竭力阻止？", "顾雍", "张昭", "2", },
	id_79 = {79, "官渡之战，曹操与袁绍兵力之比为多少？", "1：5", "1:10", "2", },
	id_80 = {80, "谁献的十面埋伏之计，使得曹军获得仓亭大胜？", "荀彧", "程昱", "2", },
	id_81 = {81, "曹丕破城后抢得甄氏时，曹几岁？", "十八", "二十", "1", },
	id_82 = {82, "甄氏原是何人的妻妾？", "袁熙", "袁谭", "1", },
	id_83 = {83, "许攸居功自傲，被谁所杀？", "许褚", "徐晃", "1", },
	id_84 = {84, "以下谁劝刘备不要坐“的卢”马？", "伊籍", "孙乾", "1", },
	id_85 = {85, "甘夫人生刘禅当夜有白鹤飞在屋上，高鸣了多少余声？", "四十", "二十", "1", },
	id_86 = {86, "甘夫人怀孕前曾梦见什么？", "金龙", "北斗", "2", },
	id_87 = {87, "刘备在何情况下见自己髀肉复生，又开始伤感起来了？", "骑马时", "洗澡时", "2", },
	id_88 = {88, "单福识得“八门金锁阵”，告诉刘备从何门入则亡？", "惊门", "杜门", "2", },
	id_89 = {89, "谁向曹操说明“单福”就是徐庶？", "荀彧", "程昱", "2", },
	id_90 = {90, "徐庶之母用什么打曹操？", "拐杖", "砚台", "2", },
	id_91 = {91, "孔明常自比何人？", "乐毅", "姜子牙", "1", },
	id_92 = {92, "刘备一顾草庐时，将谁误认为是孔明了？", "崔州平", "石广元", "1", },
	id_93 = {93, "刘备二顾草庐时，见谁在那里唱“凤翱翔于千仞兮，非梧不栖”？", "诸葛均", "孟公威", "1", },
	id_94 = {94, "孔明给刘备看了西川多少州的地图，认为此地是建基业之处？", "五十四", "四十八", "1", },
	id_95 = {95, "甘宁怕何人抢功，马上将黄祖射落并斩首？", "程普", "韩当", "1", },
	id_96 = {96, "夏侯惇率兵十万来新野，张飞揶揄孔明是什么？", "水", "鱼", "1", },
	id_97 = {97, "夏侯惇率兵十万来新野，火烧博望时正值什么季节？", "夏季", "秋季", "2", },
	id_98 = {98, "以下何人负责放水，淹死了许多被火攻而突围出新野城的曹军？", "赵云", "关羽", "2", },
	id_99 = {99, "关羽弃曹操而去，在曹操心里留下了不可磨灭的阴影，求阴影面积？", "6.6平方米", "0.3平方米", "1", },
	id_100 = {100, "孙权约了刘备在建业会面，请问烩面价格？", "230银币", "320银币", "2", },
	id_101 = {101, "吕布和貂蝉最后终于团圆了，请问圆的周长？", "0米", "3.14米", "1", },
}

local mt = {}
mt.__index = function (table, key)
	for i = 1, #keys do
		if (keys[i] == key) then
			return table[i]
		end
	end
end

function getDataById(key_id)
	local id_data = Explore_long_answer["id_" .. key_id]
	if id_data == nil then
		print("don't find data by id " .. key_id)
		return nil
	end
	if getmetatable(id_data) ~= nil then
		return id_data
	end
	setmetatable(id_data, mt)

	return id_data
end

function getArrDataByField(fieldName, fieldValue)
	local arrData = {}
	local fieldNo = 1
	for i=1, #keys do
		if keys[i] == fieldName then
			fieldNo = i
			break
		end
	end
	for k, v in pairs(Explore_long_answer) do
		if v[fieldNo] == fieldValue then
			setmetatable (v, mt)
			arrData[#arrData+1] = v
		end
	end

	return arrData
end

function release()
	_G["DB_Explore_long_answer"] = nil
	package.loaded["DB_Explore_long_answer"] = nil
	package.loaded["db/DB_Explore_long_answer"] = nil
end

