-- Filename: DB_Email.lua
-- Author: auto-created by XmlToScript tool.
-- Function: it`s auto-created by XmlToScript tool.

module("DB_Email", package.seeall)

keys = {
	"id", "purpose", "system", "name", "content", "emailNameColor", 
}

Email = {
	id_1 = {1, "资源矿占领期完成", "资源矿", "资源矿到期", "您的资源矿占领时间已到，共占领|，总计获得|。", "112,255,27", },
	id_2 = {2, "被别人抢夺后（对方失败）", "资源矿", "守护资源矿成功", "试图抢夺您的资源矿，不过失败了。", "112,255,27", },
	id_3 = {3, "被别人抢夺后（对方成功）", "资源矿", "守护资源矿失败", "夺走了您的资源矿，您共占领资源矿|，总计获得|。", "255,24,14", },
	id_4 = {4, "自己去占领别人的资源矿（成功）", "资源矿", "资源矿抢夺", "您刚刚成功抢夺了|的资源矿。", "112,255,27", },
	id_5 = {5, "自己去占领别人的资源矿（失败）", "资源矿", "资源矿抢夺", "您刚刚抢夺了|的资源矿，不过失败了。", "255,24,14", },
	id_6 = {6, "自己资源矿被强行夺走（成功）", "资源矿", "资源矿强夺", "强行夺走了您的资源矿，您共占领资源矿|,总计获得|。", "255,24,14", },
	id_7 = {7, "自己资源矿被强行夺走（失败）", "资源矿", "资源矿强夺", "强行抢夺了您的资源矿，不过失败了", "112,255,27", },
	id_8 = {8, "强行夺走别人资源矿（成功）", "资源矿", "资源矿强夺", "您刚刚成功强夺了|的资源矿", "112,255,27", },
	id_9 = {9, "强行夺走别人资源矿（失败）", "资源矿", "资源矿强夺", "您刚刚强夺了|的资源矿，不过失败了。", "255,24,14", },
	id_10 = {10, "申请好友", "好友", "申请好友", "玩家|想与你举酒结义，对天盟誓，有苦同受，有难同当，有福同享，共同实现自己人生的美好理想。附言：", "255,245,1", },
	id_11 = {11, "同意好友请求", "好友", "同意好友请求", "玩家|同意了你的好友申请，与你举酒结义，从此有福同享，有难同当", "112,255,27", },
	id_12 = {12, "拒绝好友请求", "好友", "拒绝好友请求", "玩家|拒绝了你的好友申请", "255,24,14", },
	id_13 = {13, "断绝好友关系", "好友", "断绝好友关系", "玩家|断绝了与你的好友关系", "255,24,14", },
	id_14 = {14, "好友留言", "好友", "好友留言", "：", "255,245,1", },
	id_15 = {15, "竞技场被击败", "竞技场", "竞技场被击败", "玩家|在竞技场中轻松击败了你，你的竞技场排名降至", "255,24,14", },
	id_16 = {16, "竞技场防守成功", "竞技场", "竞技场防守成功", "玩家|在竞技场中挑战你，但被你轻松击败了", "112,255,27", },
	id_17 = {17, "竞技场幸运排名奖励", "竞技场", "竞技场幸运排名奖励", "恭喜您在竞技场中获得了幸运排名|，获得幸运奖励", "112,255,27", },
	id_18 = {18, "竞技场排名奖励", "竞技场", "竞技场排名奖励", "恭喜您在|的竞技场中取得了第|名的成绩，获得奖励", "112,255,27", },
	id_19 = {19, "申请加入军团（成功）", "军团", "接受入团申请", "恭喜！审核已通过，您已成功加入了|，快去和大家打个招呼吧~", "112,255,27", },
	id_20 = {20, "申请加入军团（失败）", "军团", "拒绝入团申请", "很遗憾~|拒绝了您的公会申请！", "255,24,14", },
	id_21 = {21, "踢出军团", "军团", "踢出军团", "您被|从|踢出！", "255,24,14", },
	id_22 = {22, "充值了XX金币", "充值", "充值", "恭喜你成功充值了", "112,255,27", },
	id_23 = {23, "被掠夺", "夺宝", "被抢夺碎片", "玩家|抢夺了你，你失去了|1个。", "255,24,14", },
	id_24 = {24, "翻牌被掠夺银币", "竞技场系统", "竞技场被掠夺银币", "玩家|在竞技场中轻松击败了你，你被掠夺了|银币，排名降至|。", "255,24,14", },
	id_25 = {25, "翻牌被掠夺银币", "夺宝系统", "夺宝被掠夺银币", "玩家|抢夺了你，你被掠夺了|银币，失去|1个。", "255,24,14", },
	id_26 = {26, "翻牌被掠夺银币", "比武系统", "比武被掠夺银币", "玩家|在比武场中击败了你，你被掠夺了|银币，失去|积分。", "255,24,14", },
	id_27 = {27, "比武积分被抢夺（成功）", "比武系统", "比武积分抢夺", "玩家|在比武场中击败了你，你失去了|积分。", "255,24,14", },
	id_28 = {28, "比武排行奖励", "比武系统", "比武排行奖励", "恭喜您在比武中取得了第|名的成绩，获得奖励|。", "112,255,27", },
	id_29 = {29, "翻牌没抢到碎片被掠夺银币", "夺宝系统", "夺宝被掠夺银币", "玩家|抢夺了你，你被掠夺了|银币。", "255,24,14", },
	id_30 = {30, "VIP变动", "充值", "VIP", "恭喜您成为了VIP|玩家，逐鹿中原指日可待！", "112,255,27", },
	id_31 = {31, "竞技场被击败", "竞技场", "竞技场被击败", "玩家|在竞技场中轻松击败了你，你的竞技场排名没有改变", "255,24,14", },
	id_32 = {32, "竞技场被击败被掠夺", "竞技场", "竞技场被击败", "玩家|在竞技场中轻松击败了你，你被掠夺了|银币，竞技场排名没有改变", "255,24,14", },
	id_33 = {33, "军团切磋被击败", "军团", "军团切磋被击败", "军团成员|与你切磋，没想到你还是输他一筹！", "255,24,14", },
	id_34 = {34, "军团切磋获胜", "军团", "军团切磋获胜", "军团成员|与你切磋，你不费吹灰之力就战胜了他！", "112,255,27", },
	id_35 = {35, "城池战发奖（显示奖励）", "军团", "城池争夺战发奖", "您所在的军团在上一轮城池争夺战中成功占领了城池|，您获得了|奖励！", "112,255,27", },
	id_36 = {36, "占领时间结束", "资源矿", "资源矿协助", "您协助的资源矿占领时间已经结束，共协助|，总计获得|", "112,255,27", },
	id_37 = {37, "主动放弃协助", "资源矿", "资源矿协助", "您放弃了对资源矿的协助，共协助|，总计获得|", "112,255,27", },
	id_38 = {38, "资源矿被占领", "资源矿", "资源矿协助", "您所协助的资源矿被|占领，共协助|，总计获得|", "255,24,14", },
	id_39 = {39, "资源矿被放弃", "资源矿", "资源矿协助", "您协助的资源矿已被|放弃，共协助|，总计获得|", "112,255,27", },
	id_40 = {40, "协助被抢夺", "资源矿", "资源矿协助", "您被|抢夺为该玩家的协助者，之前共协助|，总计获得|", "112,255,27", },
	id_41 = {41, "协助时间结束", "资源矿", "资源矿协助", "您对|资源矿的协助时间已满，共协助|，总计获得|", "112,255,27", },
	id_42 = {42, "协助被抢夺矿主提示", "资源矿", "资源矿协助", "很遗憾，您所占领资源矿的协助军被|抢夺，本次共协助|", "255,24,14", },
	id_43 = {43, "擂台赛32强-4强奖励", "擂台赛", "擂台争霸奖励", "恭喜您，您在擂台争霸赛中获得|强奖励，奖励如下:|", "112,255,27", },
	id_44 = {44, "擂台赛亚军奖励", "擂台赛", "擂台争霸奖励", "恭喜您，您在擂台争霸赛中一人之下万人之上，获得亚军奖励，奖励如下：|", "112,255,27", },
	id_45 = {45, "擂台赛冠军奖励", "擂台赛", "擂台争霸奖励", "恭喜您，您在擂台争霸赛中击败了所有对手，获得冠军奖励：|", "112,255,27", },
	id_46 = {46, "擂台赛助威奖励", "擂台赛", "擂台争霸助威奖励", "您助威的选手在擂台争霸赛中获得冠军，获得助威奖励：|", "112,255,27", },
	id_47 = {47, "擂台赛幸运奖", "擂台赛", "擂台争霸幸运奖", "恭喜您在本轮的擂台幸运奖中被抽中，获得奖励如下：|", "112,255,27", },
	id_48 = {48, "擂台赛超级幸运奖", "擂台赛", "擂台争霸超级幸运奖", "恭喜您在本轮的擂台超级幸运奖中被抽中，获得奖励如下：|", "112,255,27", },
	id_49 = {49, "擂台赛奖池奖励", "擂台赛", "擂台争霸奖池奖励", "很遗憾，您的|次连胜被终结了！获得|连胜奖金：|银币", "255,24,14", },
	id_50 = {50, "擂台赛奖池奖励", "擂台赛", "擂台争霸奖池奖励", "恭喜您成功终结了|的|连胜！获得终结连胜奖金：|银币", "112,255,27", },
	id_51 = {51, "擂台赛奖池奖励", "擂台赛", "擂台争霸奖池奖励", "的|连胜被终结，奖池奖金已进行分发！恭喜您获得参与奖金：|银币", "112,255,27", },
	id_52 = {52, "群雄争霸服内傲视群雄组32强-4强奖励", "群雄争霸", "群雄争霸服内奖励", "恭喜您，您在群雄争霸服内赛的傲视群雄组中获得|强奖励，奖励如下:|", "112,255,27", },
	id_53 = {53, "群雄争霸服内初出茅庐组32强-4强奖励", "群雄争霸", "群雄争霸服内奖励", "恭喜您，您在群雄争霸服内赛的初出茅庐组中获得|强奖励，奖励如下:|", "112,255,27", },
	id_54 = {54, "群雄争霸服内傲视群雄组亚军奖励", "群雄争霸", "群雄争霸服内奖励", "恭喜您，您在群雄争霸服内赛的傲视群雄组中获得亚军奖励，奖励如下：|", "112,255,27", },
	id_55 = {55, "群雄争霸服内初出茅庐组亚军奖励", "群雄争霸", "群雄争霸服内奖励", "恭喜您，您在群雄争霸服内赛的初出茅庐组中获得亚军奖励，奖励如下：|", "112,255,27", },
	id_56 = {56, "群雄争霸服内傲视群雄组冠军奖励", "群雄争霸", "群雄争霸服内奖励", "恭喜您，您在群雄争霸服内赛的傲视群雄组中击败了所有对手，获得冠军奖励：|", "112,255,27", },
	id_57 = {57, "群雄争霸服内初出茅庐组冠军奖励", "群雄争霸", "群雄争霸服内奖励", "恭喜您，您在群雄争霸服内赛的初出茅庐组中击败了所有对手，获得冠军奖励：|", "112,255,27", },
	id_58 = {58, "群雄争霸跨服傲视群雄组32强-4强奖励", "群雄争霸", "群雄争霸跨服奖励", "恭喜您，您在群雄争霸跨服赛的傲视群雄组中获得|强奖励，奖励如下:|", "112,255,27", },
	id_59 = {59, "群雄争霸跨服初出茅庐组32强-4强奖励", "群雄争霸", "群雄争霸跨服奖励", "恭喜您，您在群雄争霸跨服赛的初出茅庐组中获得|强奖励，奖励如下:|", "112,255,27", },
	id_60 = {60, "群雄争霸跨服傲视群雄组亚军奖励", "群雄争霸", "群雄争霸跨服奖励", "恭喜您，您在群雄争霸跨服赛的傲视群雄组中获得亚军奖励，奖励如下：|", "112,255,27", },
	id_61 = {61, "群雄争霸跨服初出茅庐组亚军奖励", "群雄争霸", "群雄争霸跨服奖励", "恭喜您，您在群雄争霸跨服赛的初出茅庐组中获得亚军奖励，奖励如下：|", "112,255,27", },
	id_62 = {62, "群雄争霸跨服傲视群雄组冠军奖励", "群雄争霸", "群雄争霸跨服奖励", "恭喜您，您在群雄争霸跨服赛的傲视群雄组中击败了所有对手，获得冠军奖励：|", "112,255,27", },
	id_63 = {63, "群雄争霸跨服初出茅庐组冠军奖励", "群雄争霸", "群雄争霸跨服奖励", "恭喜您，您在群雄争霸跨服赛的初出茅庐组中击败了所有对手，获得冠军奖励：|", "112,255,27", },
	id_64 = {64, "群雄争霸助威奖励", "群雄争霸", "群雄争霸助威奖励", "恭喜您，您助威的选手在群雄争霸服内赛中获胜晋级，您获得助威奖励：|", "112,255,27", },
	id_65 = {65, "群雄争霸助威奖励", "群雄争霸", "群雄争霸助威奖励", "恭喜您，您助威的选手在群雄争霸跨服赛中获胜晋级，您获得助威奖励：|", "112,255,27", },
	id_66 = {66, "群雄争霸冠军服全服奖励", "群雄争霸", "群雄争霸冠军服奖励", "恭喜您获得了群雄争霸赛冠军服礼包奖励，奖励如下：|", "112,255,27", },
}

local mt = {}
mt.__index = function (table, key)
	for i = 1, #keys do
		if (keys[i] == key) then
			return table[i]
		end
	end
end

function getDataById(key_id)
	local id_data = Email["id_" .. key_id]
	if id_data == nil then
		print("don't find data by id " .. key_id)
		return nil
	end
	if getmetatable(id_data) ~= nil then
		return id_data
	end
	setmetatable(id_data, mt)

	return id_data
end

function getArrDataByField(fieldName, fieldValue)
	local arrData = {}
	local fieldNo = 1
	for i=1, #keys do
		if keys[i] == fieldName then
			fieldNo = i
			break
		end
	end
	for k, v in pairs(Email) do
		if v[fieldNo] == fieldValue then
			setmetatable (v, mt)
			arrData[#arrData+1] = v
		end
	end

	return arrData
end

function release()
	_G["DB_Email"] = nil
	package.loaded["DB_Email"] = nil
	package.loaded["db/DB_Email"] = nil
end

