-- Filename: DB_Explore_long_event.lua
-- Author: auto-created by XmlToScript tool.
-- Function: it`s auto-created by XmlToScript tool.

module("DB_Explore_long_event", package.seeall)

keys = {
	"id", "exploreType", "exploreConditions", "actCost", "randomProbability", "exploreExplain", "isShow", "isIcon", "doublePay", "completePay", "exploreReward", "integralReward", "pointTips", "aiTips", "aiExplorePoint", "aiExploreSort", 
}

Explore_long_event = {
	id_0 = {0, 0, "16|0", 0, 1000, "事件：入口|效果：本层入口", 1, "qidian.png", 0, 0, "0|0|0", "0|0", "事件：入口|效果：本层入口", "事件：入口|效果：本层入口", 0, 0, },
	id_1 = {1, 0, "19|0", 0, 1000, "事件：墙|效果：无法穿越", 1, "chengqiang.png", 0, 0, "0|0|0", "0|0", "事件：墙|效果：无法穿越", "事件：墙|效果：无法穿越", 0, 3, },
	id_2000 = {2000, 2, "2|21010", 1, 1000, "事件：战斗|效果：触发一次NPC战斗，战胜、贿赂则根据评级获得积分，战败、跳过无积分奖励。", 0, "chujiguaiwu.png", 0, 20, "0|0|0", "1|20,2|18,3|15,4|12,5|10,6|5,7|0,8|20", "事件：战斗|效果：触发一次NPC战斗，战胜、贿赂则根据评级获得积分，战败、跳过无积分奖励。", "事件：战斗|效果：触发一次NPC战斗，战胜、贿赂则根据评级获得积分，战败、跳过无积分奖励。", 0, 2, },
	id_1000 = {1000, 1, "1|120000", 1, 2000, "事件：黄金宝箱|效果：随机获得乌金、玄铁、翎羽、神玉、魔石其中一种15个。", 1, "huangjinbaoxiang.png", 100, 0, "0|0|0", "0|40", "事件：宝箱|效果：前往必得一种铸造橙装备所需的材料和大量积分；", "您获得了一个黄金宝箱", 40, 201, },
	id_1001 = {1001, 1, "1|120000", 1, 2000, "事件：黄金宝箱|效果：随机获得乌金、玄铁、翎羽、神玉、魔石其中一种15个。", 1, "huangjinbaoxiang.png", 100, 0, "0|0|0", "0|40", "事件：宝箱|效果：前往必得一种铸造橙装备所需的材料和大量积分；", "您获得了一个黄金宝箱", 40, 202, },
	id_1002 = {1002, 1, "1|120002", 1, 2000, "事件：黄金宝箱|效果：随机获得乌金、玄铁、翎羽、神玉、魔石其中一种15个。", 1, "huangjinbaoxiang.png", 100, 0, "0|0|0", "0|40", "事件：宝箱|效果：前往必得一种铸造橙装备所需的材料和大量积分；", "您获得了一个黄金宝箱", 120, 203, },
	id_1003 = {1003, 1, "1|120001", 1, 2000, "事件：青铜宝箱|效果：随机获得乌金、玄铁、翎羽、神玉、魔石其中一种5个。", 1, "qingtongbaoxiang.png", 40, 0, "0|0|0", "0|30", "事件：宝箱|效果：前往必得一种铸造橙装备所需的材料和中量积分；", "您获得了一个青铜宝箱", 80, 100, },
	id_3000 = {3000, 2, "3|20", 1, 7247, "事件：伏兵|效果：随机与一名玩家触发战斗，战胜、贿赂则根据评级获得积分，战败、跳过无积分奖励。", 0, "jiandanguaiwu.png", 0, 20, "0|0|0", "1|30,2|25,3|20,4|15,5|10,6|0,7|0,8|30", "事件：战斗|效果：前往将触发NPC战斗或与其他探宝玩家战斗，根据战斗评级获得不等积分；", "您在探宝中遇到了战斗事件，并获得了胜利。", 30, 1, },
	id_3001 = {3001, 2, "3|19", 1, 870, "事件：伏兵|效果：随机与一名玩家触发战斗，战胜、贿赂则根据评级获得积分，战败、跳过无积分奖励。", 0, "jiandanguaiwu.png", 0, 20, "0|0|0", "1|30,2|25,3|20,4|15,5|10,6|0,7|0,8|30", "事件：战斗|效果：前往将触发NPC战斗或与其他探宝玩家战斗，根据战斗评级获得不等积分；", "您在探宝中遇到了战斗事件，并获得了胜利。", 30, 1, },
	id_3002 = {3002, 2, "3|18", 1, 870, "事件：伏兵|效果：随机与一名玩家触发战斗，战胜、贿赂则根据评级获得积分，战败、跳过无积分奖励。", 0, "jiandanguaiwu.png", 0, 20, "0|0|0", "1|30,2|25,3|20,4|15,5|10,6|0,7|0,8|30", "事件：战斗|效果：前往将触发NPC战斗或与其他探宝玩家战斗，根据战斗评级获得不等积分；", "您在探宝中遇到了战斗事件，并获得了胜利。", 30, 1, },
	id_3003 = {3003, 2, "3|17", 1, 870, "事件：伏兵|效果：随机与一名玩家触发战斗，战胜、贿赂则根据评级获得积分，战败、跳过无积分奖励。", 0, "jiandanguaiwu.png", 0, 20, "0|0|0", "1|30,2|25,3|20,4|15,5|10,6|0,7|0,8|30", "事件：战斗|效果：前往将触发NPC战斗或与其他探宝玩家战斗，根据战斗评级获得不等积分；", "您在探宝中遇到了战斗事件，并获得了胜利。", 30, 1, },
	id_3004 = {3004, 2, "3|16", 1, 1160, "事件：伏兵|效果：随机与一名玩家触发战斗，战胜、贿赂则根据评级获得积分，战败、跳过无积分奖励。", 0, "jiandanguaiwu.png", 0, 20, "0|0|0", "1|30,2|25,3|20,4|15,5|10,6|0,7|0,8|30", "事件：战斗|效果：前往将触发NPC战斗或与其他探宝玩家战斗，根据战斗评级获得不等积分；", "您在探宝中遇到了战斗事件，并获得了胜利。", 30, 1, },
	id_3005 = {3005, 2, "3|15", 1, 1305, "事件：伏兵|效果：随机与一名玩家触发战斗，战胜、贿赂则根据评级获得积分，战败、跳过无积分奖励。", 0, "chujiguaiwu.png", 0, 20, "0|0|0", "1|30,2|25,3|20,4|15,5|10,6|0,7|0,8|30", "事件：战斗|效果：前往将触发NPC战斗或与其他探宝玩家战斗，根据战斗评级获得不等积分；", "您在探宝中遇到了战斗事件，并获得了胜利。", 30, 1, },
	id_3006 = {3006, 2, "3|14", 1, 1160, "事件：伏兵|效果：随机与一名玩家触发战斗，战胜、贿赂则根据评级获得积分，战败、跳过无积分奖励。", 0, "chujiguaiwu.png", 0, 20, "0|0|0", "1|30,2|25,3|20,4|15,5|10,6|0,7|0,8|30", "事件：战斗|效果：前往将触发NPC战斗或与其他探宝玩家战斗，根据战斗评级获得不等积分；", "您在探宝中遇到了战斗事件，并获得了胜利。", 30, 1, },
	id_3007 = {3007, 2, "3|13", 1, 435, "事件：伏兵|效果：随机与一名玩家触发战斗，战胜、贿赂则根据评级获得积分，战败、跳过无积分奖励。", 0, "chujiguaiwu.png", 0, 20, "0|0|0", "1|30,2|25,3|20,4|15,5|10,6|0,7|0,8|30", "事件：战斗|效果：前往将触发NPC战斗或与其他探宝玩家战斗，根据战斗评级获得不等积分；", "您在探宝中遇到了战斗事件，并获得了胜利。", 30, 1, },
	id_3008 = {3008, 2, "3|12", 1, 580, "事件：伏兵|效果：随机与一名玩家触发战斗，战胜、贿赂则根据评级获得积分，战败、跳过无积分奖励。", 0, "chujiguaiwu.png", 0, 20, "0|0|0", "1|30,2|25,3|20,4|15,5|10,6|0,7|0,8|30", "事件：战斗|效果：前往将触发NPC战斗或与其他探宝玩家战斗，根据战斗评级获得不等积分；", "您在探宝中遇到了战斗事件，并获得了胜利。", 30, 1, },
	id_3009 = {3009, 2, "3|11", 1, 870, "事件：伏兵|效果：随机与一名玩家触发战斗，战胜、贿赂则根据评级获得积分，战败、跳过无积分奖励。", 0, "chujiguaiwu.png", 0, 20, "0|0|0", "1|30,2|25,3|20,4|15,5|10,6|0,7|0,8|30", "事件：战斗|效果：前往将触发NPC战斗或与其他探宝玩家战斗，根据战斗评级获得不等积分；", "您在探宝中遇到了战斗事件，并获得了胜利。", 30, 1, },
	id_3010 = {3010, 2, "3|10", 1, 1160, "事件：伏兵|效果：随机与一名玩家触发战斗，战胜、贿赂则根据评级获得积分，战败、跳过无积分奖励。", 0, "chujiguaiwu.png", 0, 20, "0|0|0", "1|30,2|25,3|20,4|15,5|10,6|0,7|0,8|30", "事件：战斗|效果：前往将触发NPC战斗或与其他探宝玩家战斗，根据战斗评级获得不等积分；", "您在探宝中遇到了战斗事件，并获得了胜利。", 30, 1, },
	id_3011 = {3011, 2, "3|9", 1, 1740, "事件：伏兵|效果：随机与一名玩家触发战斗，战胜、贿赂则根据评级获得积分，战败、跳过无积分奖励。", 0, "zhongjiguaiwu.png", 0, 20, "0|0|0", "1|30,2|25,3|20,4|15,5|10,6|0,7|0,8|30", "事件：战斗|效果：前往将触发NPC战斗或与其他探宝玩家战斗，根据战斗评级获得不等积分；", "您在探宝中遇到了战斗事件，并获得了胜利。", 30, 1, },
	id_3012 = {3012, 2, "3|8", 1, 1160, "事件：伏兵|效果：随机与一名玩家触发战斗，战胜、贿赂则根据评级获得积分，战败、跳过无积分奖励。", 0, "zhongjiguaiwu.png", 0, 20, "0|0|0", "1|30,2|25,3|20,4|15,5|10,6|0,7|0,8|30", "事件：战斗|效果：前往将触发NPC战斗或与其他探宝玩家战斗，根据战斗评级获得不等积分；", "您在探宝中遇到了战斗事件，并获得了胜利。", 30, 1, },
	id_3013 = {3013, 2, "3|7", 1, 1450, "事件：伏兵|效果：随机与一名玩家触发战斗，战胜、贿赂则根据评级获得积分，战败、跳过无积分奖励。", 0, "zhongjiguaiwu.png", 0, 20, "0|0|0", "1|30,2|25,3|20,4|15,5|10,6|0,7|0,8|30", "事件：战斗|效果：前往将触发NPC战斗或与其他探宝玩家战斗，根据战斗评级获得不等积分；", "您在探宝中遇到了战斗事件，并获得了胜利。", 30, 1, },
	id_3014 = {3014, 2, "3|6", 1, 1160, "事件：伏兵|效果：随机与一名玩家触发战斗，战胜、贿赂则根据评级获得积分，战败、跳过无积分奖励。", 0, "zhongjiguaiwu.png", 0, 20, "0|0|0", "1|30,2|25,3|20,4|15,5|10,6|0,7|0,8|30", "事件：战斗|效果：前往将触发NPC战斗或与其他探宝玩家战斗，根据战斗评级获得不等积分；", "您在探宝中遇到了战斗事件，并获得了胜利。", 30, 1, },
	id_3015 = {3015, 2, "3|5", 1, 1160, "事件：伏兵|效果：随机与一名玩家触发战斗，战胜、贿赂则根据评级获得积分，战败、跳过无积分奖励。", 0, "zhongjiguaiwu.png", 0, 20, "0|0|0", "1|30,2|25,3|20,4|15,5|10,6|0,7|0,8|30", "事件：战斗|效果：前往将触发NPC战斗或与其他探宝玩家战斗，根据战斗评级获得不等积分；", "您在探宝中遇到了战斗事件，并获得了胜利。", 30, 1, },
	id_3016 = {3016, 2, "3|4", 1, 1740, "事件：伏兵|效果：随机与一名玩家触发战斗，战胜、贿赂则根据评级获得积分，战败、跳过无积分奖励。", 0, "zhongjiguaiwu.png", 0, 20, "0|0|0", "1|30,2|25,3|20,4|15,5|10,6|0,7|0,8|30", "事件：战斗|效果：前往将触发NPC战斗或与其他探宝玩家战斗，根据战斗评级获得不等积分；", "您在探宝中遇到了战斗事件，并获得了胜利。", 30, 1, },
	id_3017 = {3017, 2, "3|3", 1, 1160, "事件：伏兵|效果：随机与一名玩家触发战斗，战胜、贿赂则根据评级获得积分，战败、跳过无积分奖励。", 0, "zhongjiguaiwu.png", 0, 20, "0|0|0", "1|30,2|25,3|20,4|15,5|10,6|0,7|0,8|30", "事件：战斗|效果：前往将触发NPC战斗或与其他探宝玩家战斗，根据战斗评级获得不等积分；", "您在探宝中遇到了战斗事件，并获得了胜利。", 30, 1, },
	id_3018 = {3018, 2, "3|2", 1, 1450, "事件：伏兵|效果：随机与一名玩家触发战斗，战胜、贿赂则根据评级获得积分，战败、跳过无积分奖励。", 0, "gaojiguaiwu.png", 0, 20, "0|0|0", "1|30,2|25,3|20,4|15,5|10,6|0,7|0,8|30", "事件：战斗|效果：前往将触发NPC战斗或与其他探宝玩家战斗，根据战斗评级获得不等积分；", "您在探宝中遇到了战斗事件，并获得了胜利。", 30, 1, },
	id_3019 = {3019, 2, "3|1", 1, 1450, "事件：伏兵|效果：随机与一名玩家触发战斗，战胜、贿赂则根据评级获得积分，战败、跳过无积分奖励。", 0, "gaojiguaiwu.png", 0, 20, "0|0|0", "1|30,2|25,3|20,4|15,5|10,6|0,7|0,8|30", "事件：战斗|效果：前往将触发NPC战斗或与其他探宝玩家战斗，根据战斗评级获得不等积分；", "您在探宝中遇到了战斗事件，并获得了胜利。", 30, 1, },
	id_4000 = {4000, 3, "4|10", 1, 1000, "事件：回复|效果：回复血槽生命10%", 1, "yaoji.png", 0, 0, "0|0|0", "0|10", "事件：回复|效果：回复血槽生命10%-100%，获得10点积分", "您在探宝中遇到了回复事件，自动探宝抵消了本次状态。", 0, 1, },
	id_4001 = {4001, 3, "4|20", 1, 1000, "事件：回复|效果：回复血槽生命20%", 1, "yaoji.png", 0, 0, "0|0|0", "0|10", "事件：回复|效果：回复血槽生命10%-100%，获得10点积分", "您在探宝中遇到了回复事件，自动探宝抵消了本次状态。", 0, 1, },
	id_4002 = {4002, 3, "4|30", 1, 1000, "事件：回复|效果：回复血槽生命30%", 1, "yaoji.png", 0, 0, "0|0|0", "0|10", "事件：回复|效果：回复血槽生命10%-100%，获得10点积分", "您在探宝中遇到了回复事件，自动探宝抵消了本次状态。", 0, 1, },
	id_4003 = {4003, 3, "4|40", 1, 1000, "事件：回复|效果：回复血槽生命40%", 1, "yaoji.png", 0, 0, "0|0|0", "0|10", "事件：回复|效果：回复血槽生命10%-100%，获得10点积分", "您在探宝中遇到了回复事件，自动探宝抵消了本次状态。", 0, 1, },
	id_4004 = {4004, 3, "4|50", 1, 1000, "事件：回复|效果：回复血槽生命50%", 1, "yaoji.png", 0, 0, "0|0|0", "0|10", "事件：回复|效果：回复血槽生命10%-100%，获得10点积分", "您在探宝中遇到了回复事件，自动探宝抵消了本次状态。", 0, 1, },
	id_4005 = {4005, 3, "4|60", 1, 1000, "事件：回复|效果：回复血槽生命60%", 1, "yaoji.png", 0, 0, "0|0|0", "0|10", "事件：回复|效果：回复血槽生命10%-100%，获得10点积分", "您在探宝中遇到了回复事件，自动探宝抵消了本次状态。", 0, 1, },
	id_4006 = {4006, 3, "4|70", 1, 1000, "事件：回复|效果：回复血槽生命70%", 1, "yaoji.png", 0, 0, "0|0|0", "0|10", "事件：回复|效果：回复血槽生命10%-100%，获得10点积分", "您在探宝中遇到了回复事件，自动探宝抵消了本次状态。", 0, 1, },
	id_4007 = {4007, 3, "4|80", 1, 1000, "事件：回复|效果：回复血槽生命80%", 1, "yaoji.png", 0, 0, "0|0|0", "0|10", "事件：回复|效果：回复血槽生命10%-100%，获得10点积分", "您在探宝中遇到了回复事件，自动探宝抵消了本次状态。", 0, 1, },
	id_4008 = {4008, 3, "4|90", 1, 1000, "事件：回复|效果：回复血槽生命90%", 1, "yaoji.png", 0, 0, "0|0|0", "0|10", "事件：回复|效果：回复血槽生命10%-100%，获得10点积分", "您在探宝中遇到了回复事件，自动探宝抵消了本次状态。", 0, 1, },
	id_4009 = {4009, 3, "4|100", 1, 1000, "事件：回复|效果：回复血槽生命100%", 1, "yaoji.png", 0, 0, "0|0|0", "0|10", "事件：回复|效果：回复血槽生命10%-100%，获得10点积分", "您在探宝中遇到了回复事件，自动探宝抵消了本次状态。", 0, 1, },
	id_5000 = {5000, 3, "5|1000", 1, 1450, "事件：鼓舞|效果：攻击力+10%（只影响寻龙探宝中下一场战斗）", 0, "suijizhuangta.png", 0, 0, "0|0|0", "0|25", "事件：奇遇|效果：前往将有概率触发各类奇遇（加攻，减血，传送，减行动力，获得上轮积分，增加积分，减少积分）；", "您在探宝中遇到了鼓舞事件，自动探宝抵消了本次状态。", 35, 1, },
	id_5001 = {5001, 3, "5|2000", 1, 1450, "事件：鼓舞|效果：攻击力+20%（只影响寻龙探宝中下一场战斗）", 0, "suijizhuangta.png", 0, 0, "0|0|0", "0|25", "事件：奇遇|效果：前往将有概率触发各类奇遇（加攻，减血，传送，减行动力，获得上轮积分，增加积分，减少积分）；", "您在探宝中遇到了鼓舞事件，自动探宝抵消了本次状态。", 35, 1, },
	id_5002 = {5002, 3, "5|3000", 1, 1450, "事件：鼓舞|效果：攻击力+30%（只影响寻龙探宝中下一场战斗）", 0, "suijizhuangta.png", 0, 0, "0|0|0", "0|25", "事件：奇遇|效果：前往将有概率触发各类奇遇（加攻，减血，传送，减行动力，获得上轮积分，增加积分，减少积分）；", "您在探宝中遇到了鼓舞事件，自动探宝抵消了本次状态。", 35, 1, },
	id_5003 = {5003, 3, "5|5000", 1, 1450, "事件：鼓舞|效果：攻击力+50%（只影响寻龙探宝中下一场战斗）", 0, "suijizhuangta.png", 0, 0, "0|0|0", "0|25", "事件：奇遇|效果：前往将有概率触发各类奇遇（加攻，减血，传送，减行动力，获得上轮积分，增加积分，减少积分）；", "您在探宝中遇到了鼓舞事件，自动探宝抵消了本次状态。", 35, 1, },
	id_5004 = {5004, 3, "5|8000", 1, 1450, "事件：鼓舞|效果：攻击力+80%（只影响寻龙探宝中下一场战斗）", 0, "suijizhuangta.png", 0, 0, "0|0|0", "0|25", "事件：奇遇|效果：前往将有概率触发各类奇遇（加攻，减血，传送，减行动力，获得上轮积分，增加积分，减少积分）；", "您在探宝中遇到了鼓舞事件，自动探宝抵消了本次状态。", 35, 1, },
	id_5005 = {5005, 3, "5|10000", 1, 1450, "事件：鼓舞|效果：攻击力+100%（只影响寻龙探宝中下一场战斗）", 0, "suijizhuangta.png", 0, 0, "0|0|0", "0|25", "事件：奇遇|效果：前往将有概率触发各类奇遇（加攻，减血，传送，减行动力，获得上轮积分，增加积分，减少积分）；", "您在探宝中遇到了鼓舞事件，自动探宝抵消了本次状态。", 35, 1, },
	id_6000 = {6000, 3, "6|3", 1, 2500, "事件：遁甲|效果：行动次数+3", 1, "huanwei.png", 0, 0, "0|0|0", "0|10", "事件：遁甲|效果：增加角色行动力，获得10点积分", "事件：遁甲|效果：增加角色行动力，获得10点积分", 0, 1, },
	id_6001 = {6001, 3, "6|4", 1, 2500, "事件：遁甲|效果：行动次数+4", 1, "huanwei.png", 0, 0, "0|0|0", "0|10", "事件：遁甲|效果：增加角色行动力，获得10点积分", "事件：遁甲|效果：增加角色行动力，获得10点积分", 0, 1, },
	id_6002 = {6002, 3, "6|5", 1, 2500, "事件：遁甲|效果：行动次数+5", 1, "huanwei.png", 0, 0, "0|0|0", "0|10", "事件：遁甲|效果：增加角色行动力，获得10点积分", "事件：遁甲|效果：增加角色行动力，获得10点积分", 0, 1, },
	id_6003 = {6003, 3, "6|2", 1, 2500, "事件：遁甲|效果：行动次数+2", 1, "huanwei.png", 0, 0, "0|0|0", "0|10", "事件：遁甲|效果：增加角色行动力，获得10点积分", "事件：遁甲|效果：增加角色行动力，获得10点积分", 0, 1, },
	id_7000 = {7000, 3, "7|10", 1, 290, "事件：毒雾|效果：减少血槽生命值-10%", 0, "suijizhuangta.png", 0, 0, "0|0|0", "0|10", "事件：奇遇|效果：前往将有概率触发各类奇遇（加攻，减血，传送，减行动力，获得上轮积分，增加积分，减少积分）；", "您在探宝中遇到了毒雾事件，自动探宝抵消了本次状态。", 25, 1, },
	id_7001 = {7001, 3, "7|30", 1, 290, "事件：毒雾|效果：减少血槽生命值-30%", 0, "suijizhuangta.png", 0, 0, "0|0|0", "0|10", "事件：奇遇|效果：前往将有概率触发各类奇遇（加攻，减血，传送，减行动力，获得上轮积分，增加积分，减少积分）；", "您在探宝中遇到了毒雾事件，自动探宝抵消了本次状态。", 25, 1, },
	id_8000 = {8000, 4, "8|1", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8001 = {8001, 4, "8|2", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8002 = {8002, 4, "8|3", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8003 = {8003, 4, "8|4", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8004 = {8004, 4, "8|5", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8005 = {8005, 4, "8|6", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8006 = {8006, 4, "8|7", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8007 = {8007, 4, "8|8", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8008 = {8008, 4, "8|9", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8009 = {8009, 4, "8|10", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8010 = {8010, 4, "8|11", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8011 = {8011, 4, "8|12", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8012 = {8012, 4, "8|13", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8013 = {8013, 4, "8|14", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8014 = {8014, 4, "8|15", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8015 = {8015, 4, "8|16", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8016 = {8016, 4, "8|17", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8017 = {8017, 4, "8|18", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8018 = {8018, 4, "8|19", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8019 = {8019, 4, "8|20", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8020 = {8020, 4, "8|21", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8021 = {8021, 4, "8|22", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8022 = {8022, 4, "8|23", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8023 = {8023, 4, "8|24", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8024 = {8024, 4, "8|25", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8025 = {8025, 4, "8|26", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8026 = {8026, 4, "8|27", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8027 = {8027, 4, "8|28", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8028 = {8028, 4, "8|29", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8029 = {8029, 4, "8|30", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8030 = {8030, 4, "8|31", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8031 = {8031, 4, "8|32", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8032 = {8032, 4, "8|33", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8033 = {8033, 4, "8|34", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8034 = {8034, 4, "8|35", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8035 = {8035, 4, "8|36", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8036 = {8036, 4, "8|37", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8037 = {8037, 4, "8|38", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8038 = {8038, 4, "8|39", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8039 = {8039, 4, "8|40", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8040 = {8040, 4, "8|41", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8041 = {8041, 4, "8|42", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8042 = {8042, 4, "8|43", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8043 = {8043, 4, "8|44", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8044 = {8044, 4, "8|45", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8045 = {8045, 4, "8|46", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8046 = {8046, 4, "8|47", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8047 = {8047, 4, "8|48", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8048 = {8048, 4, "8|49", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8049 = {8049, 4, "8|50", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8050 = {8050, 4, "8|51", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8051 = {8051, 4, "8|52", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8052 = {8052, 4, "8|53", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8053 = {8053, 4, "8|54", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8054 = {8054, 4, "8|55", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8055 = {8055, 4, "8|56", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8056 = {8056, 4, "8|57", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8057 = {8057, 4, "8|58", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8058 = {8058, 4, "8|59", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8059 = {8059, 4, "8|60", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8060 = {8060, 4, "8|61", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8061 = {8061, 4, "8|62", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8062 = {8062, 4, "8|63", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8063 = {8063, 4, "8|64", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8064 = {8064, 4, "8|65", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8065 = {8065, 4, "8|66", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8066 = {8066, 4, "8|67", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8067 = {8067, 4, "8|68", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8068 = {8068, 4, "8|69", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8069 = {8069, 4, "8|70", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8070 = {8070, 4, "8|71", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8071 = {8071, 4, "8|72", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8072 = {8072, 4, "8|73", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8073 = {8073, 4, "8|74", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8074 = {8074, 4, "8|75", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8075 = {8075, 4, "8|76", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8076 = {8076, 4, "8|77", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8077 = {8077, 4, "8|78", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8078 = {8078, 4, "8|79", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8079 = {8079, 4, "8|80", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8080 = {8080, 4, "8|81", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8081 = {8081, 4, "8|82", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8082 = {8082, 4, "8|83", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8083 = {8083, 4, "8|84", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8084 = {8084, 4, "8|85", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8085 = {8085, 4, "8|86", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8086 = {8086, 4, "8|87", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8087 = {8087, 4, "8|88", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8088 = {8088, 4, "8|89", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8089 = {8089, 4, "8|90", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8090 = {8090, 4, "8|91", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8091 = {8091, 4, "8|92", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8092 = {8092, 4, "8|93", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8093 = {8093, 4, "8|94", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8094 = {8094, 4, "8|95", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8095 = {8095, 4, "8|96", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8096 = {8096, 4, "8|97", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8097 = {8097, 4, "8|98", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8098 = {8098, 4, "8|99", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8099 = {8099, 4, "8|100", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_8100 = {8100, 4, "8|101", 1, 290, "事件：谜题|效果：触发答题事件", 0, "zhishiwenda.png", 0, 20, "0|0|0", "1|28,2|14", "事件：谜题|效果：前往将触发谜题，答对则可增加28积分，答错则增加14积分；", "您在探宝中遇到了谜题事件，自动探宝帮您完成了本次答题", 28, 1, },
	id_9000 = {9000, 3, "9|0", 1, 3334, "事件：指路|效果：开启指定位置迷雾的事件", 0, "suijizhuangta.png", 0, 0, "0|0|0", "0|10", "事件：奇遇|效果：前往将有概率触发各类奇遇（加攻，减血，传送，减行动力，获得上轮积分，增加积分，减少积分）；", "事件：奇遇|效果：前往将有概率触发各类奇遇（加攻，减血，传送，减行动力，获得上轮积分，增加积分，减少积分）；", 0, 1, },
	id_10000 = {10000, 5, "10|15", 0, 1450, "事件：传送|效果：随机传送到该层某个位置", 0, "suijizhuangta.png", 0, 0, "0|0|0", "0|25", "事件：传送|效果：前往则随机传送到本层某个位置，获得25积分", "您在探宝中遇到了传送事件，自动探宝抵消了本次状态。", 30, 1, },
	id_10001 = {10001, 5, "10|21", 0, 1450, "事件：传送|效果：随机传送到该层某个位置", 0, "suijizhuangta.png", 0, 0, "0|0|0", "0|25", "事件：传送|效果：前往则随机传送到本层某个位置，获得25积分", "您在探宝中遇到了传送事件，自动探宝抵消了本次状态。", 30, 1, },
	id_10002 = {10002, 5, "10|64", 0, 1450, "事件：传送|效果：随机传送到该层某个位置", 0, "suijizhuangta.png", 0, 0, "0|0|0", "0|25", "事件：传送|效果：前往则随机传送到本层某个位置，获得25积分", "您在探宝中遇到了传送事件，自动探宝抵消了本次状态。", 30, 1, },
	id_10003 = {10003, 5, "10|46", 0, 1450, "事件：传送|效果：随机传送到该层某个位置", 0, "suijizhuangta.png", 0, 0, "0|0|0", "0|25", "事件：传送|效果：前往则随机传送到本层某个位置，获得25积分", "您在探宝中遇到了传送事件，自动探宝抵消了本次状态。", 30, 1, },
	id_10004 = {10004, 5, "10|70", 0, 1450, "事件：传送|效果：随机传送到该层某个位置", 0, "suijizhuangta.png", 0, 0, "0|0|0", "0|25", "事件：传送|效果：前往则随机传送到本层某个位置，获得25积分", "您在探宝中遇到了传送事件，自动探宝抵消了本次状态。", 30, 1, },
	id_11000 = {11000, 3, "11|1", 1, 2500, "事件：破除|效果：破除周围1个格子中的事件。", 0, "suijizhuangta.png", 0, 0, "0|0|0", "0|10", "事件：奇遇|效果：前往将有概率触发各类奇遇（加攻，减血，传送，减行动力，获得上轮积分，增加积分，减少积分）；", "您在探宝中遇到了破除事件，自动探宝抵消了本次状态。", 0, 1, },
	id_11001 = {11001, 3, "11|2", 1, 2500, "事件：破除|效果：破除周围2个格子中的事件。", 0, "suijizhuangta.png", 0, 0, "0|0|0", "0|10", "事件：奇遇|效果：前往将有概率触发各类奇遇（加攻，减血，传送，减行动力，获得上轮积分，增加积分，减少积分）；", "您在探宝中遇到了破除事件，自动探宝抵消了本次状态。", 0, 1, },
	id_12000 = {12000, 3, "12|1", 1, 1450, "事件：横祸|效果：行动次数-1", 0, "suijizhuangta.png", 0, 0, "0|0|0", "0|10", "事件：奇遇|效果：前往将有概率触发各类奇遇（加攻，减血，传送，减行动力，获得上轮积分，增加积分，减少积分）；", "您在探宝中遇到了横祸事件，自动探宝抵消了本次状态。", 0, 1, },
	id_12001 = {12001, 3, "12|2", 1, 1450, "事件：横祸|效果：行动次数-2", 0, "suijizhuangta.png", 0, 0, "0|0|0", "0|10", "事件：奇遇|效果：前往将有概率触发各类奇遇（加攻，减血，传送，减行动力，获得上轮积分，增加积分，减少积分）；", "您在探宝中遇到了横祸事件，自动探宝抵消了本次状态。", 0, 1, },
	id_13000 = {13000, 3, "13|1", 1, 1450, "事件：回梦|效果：获得上一步事件的积分", 0, "suijizhuangta.png", 0, 0, "0|0|0", "0|20", "事件：奇遇|效果：前往将有概率触发各类奇遇（加攻，减血，传送，减行动力，获得上轮积分，增加积分，减少积分）；", "您在探宝中遇到了回梦事件，自动探宝抵消了本次状态。", 35, 1, },
	id_13001 = {13001, 3, "13|1", 1, 1450, "事件：回梦|效果：获得上一步事件的积分", 0, "suijizhuangta.png", 0, 0, "0|0|0", "0|20", "事件：奇遇|效果：前往将有概率触发各类奇遇（加攻，减血，传送，减行动力，获得上轮积分，增加积分，减少积分）；", "您在探宝中遇到了回梦事件，自动探宝抵消了本次状态。", 35, 1, },
	id_14000 = {14000, 3, "14|5", 1, 1450, "事件：天怜|效果：积分+5", 0, "suijizhuangta.png", 0, 0, "0|0|0", "0|20", "事件：奇遇|效果：前往将有概率触发各类奇遇（加攻，减血，传送，减行动力，获得上轮积分，增加积分，减少积分）；", "您在探宝中遇到了天怜事件，自动探宝抵消了本次状态。", 40, 1, },
	id_14001 = {14001, 3, "14|10", 1, 1450, "事件：天怜|效果：积分+10", 0, "suijizhuangta.png", 0, 0, "0|0|0", "0|20", "事件：奇遇|效果：前往将有概率触发各类奇遇（加攻，减血，传送，减行动力，获得上轮积分，增加积分，减少积分）；", "您在探宝中遇到了天怜事件，自动探宝抵消了本次状态。", 40, 1, },
	id_14002 = {14002, 3, "14|15", 1, 1450, "事件：天怜|效果：积分+15", 0, "suijizhuangta.png", 0, 0, "0|0|0", "0|20", "事件：奇遇|效果：前往将有概率触发各类奇遇（加攻，减血，传送，减行动力，获得上轮积分，增加积分，减少积分）；", "您在探宝中遇到了天怜事件，自动探宝抵消了本次状态。", 40, 1, },
	id_14003 = {14003, 3, "14|20", 1, 1450, "事件：天怜|效果：积分+20", 0, "suijizhuangta.png", 0, 0, "0|0|0", "0|20", "事件：奇遇|效果：前往将有概率触发各类奇遇（加攻，减血，传送，减行动力，获得上轮积分，增加积分，减少积分）；", "您在探宝中遇到了天怜事件，自动探宝抵消了本次状态。", 40, 1, },
	id_14004 = {14004, 3, "14|25", 1, 1450, "事件：天怜|效果：积分+25", 0, "suijizhuangta.png", 0, 0, "0|0|0", "0|20", "事件：奇遇|效果：前往将有概率触发各类奇遇（加攻，减血，传送，减行动力，获得上轮积分，增加积分，减少积分）；", "您在探宝中遇到了天怜事件，自动探宝抵消了本次状态。", 40, 1, },
	id_15000 = {15000, 3, "15|5", 1, 2416, "事件：天谴|效果：积分-5", 0, "suijizhuangta.png", 0, 0, "0|0|0", "0|20", "事件：奇遇|效果：前往将有概率触发各类奇遇（加攻，减血，传送，减行动力，获得上轮积分，增加积分，减少积分）；", "您在探宝中遇到了天谴事件，自动探宝抵消了本次状态。", 30, 1, },
	id_15001 = {15001, 3, "15|10", 1, 2416, "事件：天谴|效果：积分-10", 0, "suijizhuangta.png", 0, 0, "0|0|0", "0|20", "事件：奇遇|效果：前往将有概率触发各类奇遇（加攻，减血，传送，减行动力，获得上轮积分，增加积分，减少积分）；", "您在探宝中遇到了天谴事件，自动探宝抵消了本次状态。", 30, 1, },
	id_15002 = {15002, 3, "15|15", 1, 2416, "事件：天谴|效果：积分-15", 0, "suijizhuangta.png", 0, 0, "0|0|0", "0|20", "事件：奇遇|效果：前往将有概率触发各类奇遇（加攻，减血，传送，减行动力，获得上轮积分，增加积分，减少积分）；", "您在探宝中遇到了天谴事件，自动探宝抵消了本次状态。", 30, 1, },
	id_17000 = {17000, 5, "17|1", 1, 10000, "事件：下一层|效果：前往下一层", 1, "xiayiceng.png", 0, 0, "0|0|0", "0|30", "事件：下一层|效果：前往下一层，获得30积分", "您进入了下一层", 100, 300, },
	id_18000 = {18000, 0, "18|120003", 1, 10000, "事件：终点|效果：本轮探宝结束，获得任意橙装铸造图纸2个（图纸可用于铸造橙装）。", 1, "zhongdian.png", 0, 0, "0|0|0", "0|60", "事件：终点|效果：本轮探宝结束，获得任意橙装铸造图纸2个（图纸可用于铸造橙装）。", "您在完成了本轮探宝", 100, 400, },
}

local mt = {}
mt.__index = function (table, key)
	for i = 1, #keys do
		if (keys[i] == key) then
			return table[i]
		end
	end
end

function getDataById(key_id)
	local id_data = Explore_long_event["id_" .. key_id]
	if id_data == nil then
		print("don't find data by id " .. key_id)
		return nil
	end
	if getmetatable(id_data) ~= nil then
		return id_data
	end
	setmetatable(id_data, mt)

	return id_data
end

function getArrDataByField(fieldName, fieldValue)
	local arrData = {}
	local fieldNo = 1
	for i=1, #keys do
		if keys[i] == fieldName then
			fieldNo = i
			break
		end
	end
	for k, v in pairs(Explore_long_event) do
		if v[fieldNo] == fieldValue then
			setmetatable (v, mt)
			arrData[#arrData+1] = v
		end
	end

	return arrData
end

function release()
	_G["DB_Explore_long_event"] = nil
	package.loaded["DB_Explore_long_event"] = nil
	package.loaded["db/DB_Explore_long_event"] = nil
end

