-- Filename: DB_Pet.lua
-- Author: auto-created by XmlToScript tool.
-- Function: it`s auto-created by XmlToScript tool.

module("DB_Pet", package.seeall)

keys = {
	"id", "roleName", "des", "roleModelID", "headIcon", "quality", "expUpgradeID", "graspOrgin", "graspGrowth", "graspCd", "speicalSkills", "talentSkills", "orginSkills", "randSkills", "orginColums", "ColumLimit", "levelLimit", "petSource", "swallow", "swallowPet", "resetSkillGold", "petQuality", "petResourceType", "talentSkillNum", "produceDes", "talentDes", "normalDes", "sellSilver", "handBook", "bookTips", "lockSkillNum", 
}

Pet = {
	id_1 = {1, "烈焰马", "烈焰马，究竟跑得有多快呢？它经常跑着跑着身上的毛就跟空气摩擦着火了！", "pet_quan_zaoma.png", "pet_head_zaoma.png", 3, 1003, 1, 1, 2, "0|0|1000", "2011|1|10000,2012|1|10000", nil, "1101,1105,1102,1103,1104,1106,1107,1108,1109,1110,1201,1202,1203,1204,1205,1206,1207,1208,1209,1210,1301,1302,1303,1304,1305,1306,1307,1308,1309,1310", 0, 3, 6, nil, 2, "1|99,100|99,200|99", 30, 8, 1, 1, "该宠物无特殊技能", "{一日千里}：领悟普通技能[高级威慑]可激活“全部普通技能等级+1”效果", "最大可领悟技能个数：3\n单个技能等级上限：6\n初始技能点数：1", "10000,500", 1, "挑战普通副本Boss据点有概率获得烈焰马碎片（吞噬获得2点领悟点）", 2, },
	id_2 = {2, "火羽神鹰", "火羽神鹰，天生翅膀可以燃起火焰，甚至可以刮起火焰风暴！", "pet_quan_huoying.png", "pet_head_huoying.png", 4, 1004, 2, 1, 2, "0|0|1000", "2021|1|10000,2022|1|10000", nil, "1101,1105,1102,1103,1104,1106,1107,1108,1109,1110,1201,1202,1203,1204,1205,1206,1207,1208,1209,1210,1301,1302,1303,1304,1305,1306,1307,1308,1309,1310", 0, 4, 6, nil, 2, "1|99,100|99,200|99", 40, 9, 2, 1, "该宠物无特殊技能", "{神鹰展翅}：领悟普通技能[高级追魂]可激活“全部普通技能等级+1”效果", "最大可领悟技能个数：4\n单个技能等级上限：6\n初始技能点数：2", "10000,500", 1, "挑战普通副本Boss据点有概率获得火羽神鹰碎片（吞噬获得2点领悟点）", 2, },
	id_3 = {3, "三尾灵狐", "三尾灵狐，修行数百年而拥有了三条尾巴，据说每一只三尾灵狐年轻的时候都被一个书生救过。", "pet_quan_huli.png", "pet_head_huli.png", 4, 1004, 2, 1, 2, "0|0|1000", "2031|1|10000,2032|1|10000", nil, "1101,1105,1102,1103,1104,1106,1107,1108,1109,1110,1201,1202,1203,1204,1205,1206,1207,1208,1209,1210,1301,1302,1303,1304,1305,1306,1307,1308,1309,1310", 0, 4, 7, nil, 2, "1|99,100|99,200|99", 40, 10, 3, 1, "该宠物无特殊技能", "{千灵百媚}：领悟普通技能[高级活力]可激活“全部普通技能等级+1”效果", "最大可领悟技能个数：4\n单个技能等级上限：7\n初始技能点数：2", "10000,500", 1, "挑战普通副本Boss据点有概率获得三尾灵狐碎片（吞噬获得2点领悟点）", 2, },
	id_4 = {4, "霸影云虎", "霸影云虎，来无影去无踪，只在仙山出没。由于常年有云雾环绕，所以远看就像在云间奔跑一样。", "pet_quan_laohu.png", "pet_head_laohu.png", 5, 1005, 3, 1, 2, "11401|1|30000,11402|1|24000,11403|1|18000,11404|1|12000,11501|1|30000,11502|1|24000,11503|1|18000,11504|1|12000,11601|1|30000,11602|1|24000,11603|1|18000,11604|1|12000", "2041|1|10000,2042|1|10000,2043|1|10000", nil, "1101,1105,1102,1103,1104,1106,1107,1108,1109,1110,1201,1202,1203,1204,1205,1206,1207,1208,1209,1210,1301,1302,1303,1304,1305,1306,1307,1308,1309,1310", 0, 4, 8, nil, 2, "1|99,100|99,200|99", 50, 11, 4, 1, "合成后将随机获得1个特殊技能", "{百兽之王}：与烈焰马、火羽神鹰、三尾灵狐一起上阵可激活“全部普通技能等级+1”效果", "最大可领悟技能个数：4\n单个技能等级上限：8\n初始技能点数：3", "10000,500", 1, "挑战普通副本Boss据点有概率获得霸影云虎碎片（吞噬获得2点领悟点）", 2, },
	id_5 = {5, "幽火冥狼", "幽火冥狼，只有在试练塔中取得一定成绩的强者才能受到它的青睐，可以说是强者的象征。", "pet_quan_minglang.png", "pet_head_minglang.png", 5, 1005, 5, 1, 2, "20011|1|30000", "2051|1|10000,2052|1|10000,2053|1|10000", nil, "1101,1105,1102,1103,1104,1106,1107,1108,1109,1110,1201,1202,1203,1204,1205,1206,1207,1208,1209,1210,1301,1302,1303,1304,1305,1306,1307,1308,1309,1310", 0, 5, 8, nil, 2, "1|99,100|99,200|99", 50, 12, 5, 1, "合成后将随机获得1个特殊技能", "{鬼哭狼嚎}：领悟普通技能[高级嗜血]可激活“全部普通技能等级+1”效果", "最大可领悟技能个数：5\n单个技能等级上限：8\n初始技能点数：5", "10000,500", 1, "挑战“活动”-“试练塔”可以获得幽火冥狼碎片（吞噬获得2点领悟点）", 2, },
	id_6 = {6, "青羽应龙", "青羽应龙，于青龙魔神的残骸中诞生的迷你应龙，虽然不具有那样大的力量，但是一样拥有呼风唤雨的法力。", "pet_quan_qinglong.png", "pet_head_qinglong.png", 5, 1005, 10, 1, 2, "20021|1|30000", "2061|1|10000,2062|1|10000,2063|1|10000", nil, "1101,1105,1102,1103,1104,1106,1107,1108,1109,1110,1201,1202,1203,1204,1205,1206,1207,1208,1209,1210,1301,1302,1303,1304,1305,1306,1307,1308,1309,1310,1401,1402,1403,1404,1405,1406,1407,1408,1409,1410", 0, 5, 9, nil, 2, "1|99,100|99,200|99", 50, 16, 6, 1, "合成后将随机获得1个特殊技能", "{龙盘九天}：领悟普通技能[超级利爪]可激活“全部普通技能等级+1”效果", "最大可领悟技能个数：5\n单个技能等级上限：9\n初始技能点数：10", "10000,500", 1, "挑战“活动”-“进击的魔神”可以获得青羽应龙碎片（吞噬获得2点领悟点）", 2, },
	id_7 = {7, "小鹿", nil, "pet_quan_lu.png", "pet_head_lu.png", 5, 1005, 15, 1, 2, "11403|1|18000,11404|1|12000,11405|1|6000,11503|1|18000,11504|1|12000,11505|1|6000,11603|1|18000,11604|1|12000,11605|1|6000", "2071|1|10000,2072|1|10000,2073|1|10000", nil, "1101,1105,1102,1103,1104,1106,1107,1108,1109,1110,1201,1202,1203,1204,1205,1206,1207,1208,1209,1210,1301,1302,1303,1304,1305,1306,1307,1308,1309,1310,1401,1402,1403,1404,1405,1406,1407,1408,1409,1410", 0, 5, 10, nil, 2, "1|99,100|99,200|99", 50, 18, 7, 1, "合成后将随机获得1个特殊技能", nil, "最大可领悟技能个数：5\n单个技能等级上限：10\n初始技能点数：15", "10000,500", 0, "通过副本指定据点获得|通过竞技场排名获得|通过比武排名获得", 2, },
	id_8 = {8, "乾神飞马", "乾神飞马，仙人所养的飞马，自幼熟读各种阵法，什么八卦阵之类的，骑上它就能轻松走出去了。", "pet_quan_tianma.png", "pet_head_tianma.png", 5, 1005, 15, 1, 2, "20031|1|30000", "2081|1|10000,2082|1|10000,2083|1|10000", nil, "1101,1105,1102,1103,1104,1106,1107,1108,1109,1110,1201,1202,1203,1204,1205,1206,1207,1208,1209,1210,1301,1302,1303,1304,1305,1306,1307,1308,1309,1310,1401,1402,1403,1404,1405,1406,1407,1408,1409,1410", 0, 5, 10, nil, 5, "1|99,100|99,200|99", 50, 18, 8, 1, "合成后将随机获得1个特殊技能", nil, "最大可领悟技能个数：5\n单个技能等级上限：10\n初始技能点数：15", "10000,500", 1, "通过特殊活动获得，特殊活动的开启请关注游戏公告（吞噬获得5点领悟点）", 2, },
	id_9 = {9, "熊", nil, "pet_quan_xiong.png", "pet_head_xiong.png", 5, 1005, 15, 1, 2, "11403|1|18000,11404|1|12000,11405|1|6000,11503|1|18000,11504|1|12000,11505|1|6000,11603|1|18000,11604|1|12000,11605|1|6000", "2091|1|10000,2092|1|10000,2093|1|10000", nil, "1101,1105,1102,1103,1104,1106,1107,1108,1109,1110,1201,1202,1203,1204,1205,1206,1207,1208,1209,1210,1301,1302,1303,1304,1305,1306,1307,1308,1309,1310,1401,1402,1403,1404,1405,1406,1407,1408,1409,1410", 0, 5, 10, nil, 2, "1|99,100|99,200|99", 50, 18, 9, 1, "合成后将随机获得1个特殊技能", nil, "最大可领悟技能个数：5\n单个技能等级上限：10\n初始技能点数：15", "10000,500", 0, "暂未开放", 2, },
	id_10 = {10, "狮子", nil, "pet_quan_shizi.png", "pet_head_shizi.png", 5, 1005, 15, 1, 2, "11403|1|18000,11404|1|12000,11405|1|6000,11503|1|18000,11504|1|12000,11505|1|6000,11603|1|18000,11604|1|12000,11605|1|6000", "2101|1|10000,2102|1|10000,2103|1|10000", nil, "1101,1105,1102,1103,1104,1106,1107,1108,1109,1110,1201,1202,1203,1204,1205,1206,1207,1208,1209,1210,1301,1302,1303,1304,1305,1306,1307,1308,1309,1310,1401,1402,1403,1404,1405,1406,1407,1408,1409,1410", 0, 5, 10, nil, 2, "1|99,100|99,200|99", 50, 18, 10, 1, "合成后将随机获得1个特殊技能", nil, "最大可领悟技能个数：5\n单个技能等级上限：10\n初始技能点数：15", "10000,500", 0, "暂未开放", 2, },
	id_11 = {11, "六翼麒麟", "六翼麒麟，经常遨游于银河之中，背上的六翼令人心醉。", "pet_quan_qilin.png", "pet_head_qilin.png", 5, 1005, 32, 1, 2, "20051|1|30000", "2111|1|10000,2112|1|10000,2113|1|10000", nil, "1101,1105,1102,1103,1104,1106,1107,1108,1109,1110,1201,1202,1203,1204,1205,1206,1207,1208,1209,1210,1301,1302,1303,1304,1305,1306,1307,1308,1309,1310,1401,1402,1403,1404,1405,1406,1407,1408,1409,1410", 0, 6, 11, nil, 10, "1|99,100|99,200|99", 50, 20, 11, 1, "合成后将随机获得1个特殊技能", nil, "最大可领悟技能个数：6\n单个技能等级上限：11\n初始技能点数：32", "10000,500", 1, "通过群雄争霸赛获得（吞噬获得10点领悟点）", 3, },
	id_12 = {12, "宠物6", nil, "0", "0", 5, nil, 0, 1, 2, "0|0|1000", "0|0|1000", nil, nil, 0, 0, 0, nil, 1, "1|99,100|99,200|99", 50, 12, 12, 1, "合成后将随机获得1个特殊技能", nil, "最大可领悟技能个数：0\n单个技能等级上限：0\n初始技能点数：0", "10000,500", 0, "暂未开放", 2, },
	id_13 = {13, "宠物7", nil, "0", "0", 5, nil, 0, 1, 2, "0|0|1000", "0|0|1000", nil, nil, 0, 0, 0, nil, 1, "1|99,100|99,200|99", 50, 12, 13, 1, "合成后将随机获得1个特殊技能", nil, "最大可领悟技能个数：0\n单个技能等级上限：0\n初始技能点数：0", "10000,500", 0, "暂未开放", 2, },
	id_14 = {14, "宠物8", nil, "0", "0", 5, nil, 0, 1, 2, "0|0|1000", "0|0|1000", nil, nil, 0, 0, 0, nil, 1, "1|99,100|99,200|99", 50, 12, 14, 1, "合成后将随机获得1个特殊技能", nil, "最大可领悟技能个数：0\n单个技能等级上限：0\n初始技能点数：0", "10000,500", 0, "暂未开放", 2, },
	id_15 = {15, "宠物9", nil, "0", "0", 5, nil, 0, 1, 2, "0|0|1000", "0|0|1000", nil, nil, 0, 0, 0, nil, 1, "1|99,100|99,200|99", 50, 12, 15, 1, "合成后将随机获得1个特殊技能", nil, "最大可领悟技能个数：0\n单个技能等级上限：0\n初始技能点数：0", "10000,500", 0, "暂未开放", 2, },
	id_16 = {16, "宠物10", nil, "0", "0", 5, nil, 0, 1, 2, "0|0|1000", "0|0|1000", nil, nil, 0, 0, 0, nil, 1, "1|99,100|99,200|99", 50, 12, 16, 1, "合成后将随机获得1个特殊技能", nil, "最大可领悟技能个数：0\n单个技能等级上限：0\n初始技能点数：0", "10000,500", 0, "暂未开放", 2, },
	id_17 = {17, "宠物11", nil, "0", "0", 5, nil, 0, 1, 2, "0|0|1000", "0|0|1000", nil, nil, 0, 0, 0, nil, 1, "1|99,100|99,200|99", 50, 12, 17, 1, "合成后将随机获得1个特殊技能", nil, "最大可领悟技能个数：0\n单个技能等级上限：0\n初始技能点数：0", "10000,500", 0, "暂未开放", 2, },
	id_18 = {18, "宠物12", nil, "0", "0", 5, nil, 0, 1, 2, "0|0|1000", "0|0|1000", nil, nil, 0, 0, 0, nil, 1, "1|99,100|99,200|99", 50, 12, 18, 1, "合成后将随机获得1个特殊技能", nil, "最大可领悟技能个数：0\n单个技能等级上限：0\n初始技能点数：0", "10000,500", 0, "暂未开放", 2, },
	id_19 = {19, "宠物13", nil, "0", "0", 5, nil, 0, 1, 2, "0|0|1000", "0|0|1000", nil, nil, 0, 0, 0, nil, 1, "1|99,100|99,200|99", 50, 12, 19, 1, "合成后将随机获得1个特殊技能", nil, "最大可领悟技能个数：0\n单个技能等级上限：0\n初始技能点数：0", "10000,500", 0, "暂未开放", 2, },
	id_20 = {20, "宠物14", nil, "0", "0", 5, nil, 0, 1, 2, "0|0|1000", "0|0|1000", nil, nil, 0, 0, 0, nil, 1, "1|99,100|99,200|99", 50, 12, 20, 1, "合成后将随机获得1个特殊技能", nil, "最大可领悟技能个数：0\n单个技能等级上限：0\n初始技能点数：0", "10000,500", 0, "暂未开放", 2, },
}

local mt = {}
mt.__index = function (table, key)
	for i = 1, #keys do
		if (keys[i] == key) then
			return table[i]
		end
	end
end

function getDataById(key_id)
	local id_data = Pet["id_" .. key_id]
	if id_data == nil then
		print("don't find data by id " .. key_id)
		return nil
	end
	if getmetatable(id_data) ~= nil then
		return id_data
	end
	setmetatable(id_data, mt)

	return id_data
end

function getArrDataByField(fieldName, fieldValue)
	local arrData = {}
	local fieldNo = 1
	for i=1, #keys do
		if keys[i] == fieldName then
			fieldNo = i
			break
		end
	end
	for k, v in pairs(Pet) do
		if v[fieldNo] == fieldValue then
			setmetatable (v, mt)
			arrData[#arrData+1] = v
		end
	end

	return arrData
end

function release()
	_G["DB_Pet"] = nil
	package.loaded["DB_Pet"] = nil
	package.loaded["db/DB_Pet"] = nil
end

