-- Filename: DB_Star_act.lua
-- Author: auto-created by XmlToScript tool.
-- Function: it`s auto-created by XmlToScript tool.

module("DB_Star_act", package.seeall)

keys = {
	"id", "name", "enduranceBase", "enduranceIncrease", "prizeType", "prizeNum", "text_1", "text_2", "text_3", 
}

Star_act = {
	id_1001 = {1001, "赠礼", 2, nil, 6, "160|0,180|1,200|2,220|3,240|4,260|5", "主公竟然送我如此名贵之物，末将感激不禁。", "这，这真的是给我的吗？如此高端，如此大气，如此上档次，太……太激动了。", "哇！主公人好好！爱死你啦！", },
	id_1002 = {1002, "共寝", 4, nil, 6, "320|0,360|1,400|2,440|3,480|4,520|5", "主公，人家衣衫已尽，你就跟人家看这个？", "别这样，主公别这样，你对人周瑜也是这样的吗，人家会羞羞的……", "主公，今晚就让我们把节操当做路人！！请骑着我向夕阳奔跑吧。", },
	id_1003 = {1003, "打猎", 2, nil, 6, "160|0,180|1,200|2,220|3,240|4,260|5", "嚯，好大一只兔子，乖乖别跑，到我囊中来吧！", "主公，亮出你的兵器，今日让我们在野外战个痛快！", "主公好厉害，10发全中，小的自愧不如，一只猎犬都没射中……", },
	id_1004 = {1004, "私访", 4, nil, 6, "320|0,360|1,400|2,440|3,480|4,520|5", "听说富二代孙权正在家中开宴会，宴请众多三国名流，主公可有兴趣一同前往？", "哎呀，这不是主公吗，进来玩呗~晚上一起去K歌吧", "有朋自远方来，不亦乐乎。欢迎主公光临寒舍。", },
	id_1005 = {1005, "下棋", 2, nil, 6, "160|0,180|1,200|2,220|3,240|4,260|5", "据说今天是下五子棋呢还是五子棋呢或是五子棋呢？", "伏龙凤雏，得一可安天下，说得就是五子棋界的两大顶尖高手。", "主公我认输了还不行嘛，求主公不要考验在下的智商了……", },
	id_1006 = {1006, "按摩", 2, nil, 6, "160|0,180|1,200|2,220|3,240|4,260|5", "主公，那边！啊~~主公，左边点，嗯哼哼~啊，主公！痒痒~", "主公，听闻甄姬在新野最近开发出一种新式SPA，不知主公想要尝试否？", "主公今天是想做泰式全身按摩还是足底药浴呢，我有3折VIP金卡？", },
	id_1007 = {1007, "赏月", 2, nil, 6, "160|0,180|1,200|2,220|3,240|4,260|5", "主公，月色这么好，我们来作诗吧！月，月亮啊……月亮你好圆啊啊！！", "举头望明月，低头思故乡。主公，你还记得我们那些年我们一起追过的妹纸和汉子么？", "今夜月亮这么明亮，主公你如此小清新，为何我却觉得内心有种淡淡的忧桑呢？", },
	id_1008 = {1008, "共饮", 2, nil, 6, "160|0,180|1,200|2,220|3,240|4,260|5", "哈哈哈哈哈哈！！好酒！！！再来一杯！", "听说张辽自酿的白酒最好了，主公你是要啤的还是白的！来，来干了！！", "主公好酒量，臣不行了……咯，主公你好厉害，都变成3个了。", },
	id_1009 = {1009, "抚琴", 2, nil, 6, "160|0,180|1,200|2,220|3,240|4,260|5", "古有诗云：余音绕梁，三日不绝。今夜良辰美景，又有主公相陪，此生何求。", "月华如水，琴瑟悠扬，主公，不知此时，你心里想得是貂蝉还是娇滴滴的董卓？", "不知主公喜欢听什么小曲儿，现代的，流行还是经典或民族的？", },
	id_1010 = {1010, "巡兵", 2, nil, 6, "160|0,180|1,200|2,220|3,240|4,260|5", "主公，请检阅我们的精英部队吧，我和我的小伙伴们等你好久了。", "来，大家跟我一起喊，主公威武！主公霸气！", "主公，请看看这些将士吧，他们都愿意追随您征战四方！", },
	id_1011 = {1011, "比试", 2, nil, 6, "160|0,180|1,200|2,220|3,240|4,260|5", "来来来，让我们大战300回合，不过瘾决不罢休！哈哈", "昨天吕布那厮非要找我单挑，我一个必杀就把他撂倒了，脆得不行。", "我手持青龙偃月刀，身穿黑金白银甲，脚踏赤兔千里马，攻击防御这么高，看你如何伤我。", },
	id_1012 = {1012, "论道", 2, nil, 6, "160|0,180|1,200|2,220|3,240|4,260|5", "我最喜欢的事情就是跟人聊聊理想谈谈人生了。", "经过主公一番教导，在下犹如拨云见日，豁然开朗。", "对于我这种智力100的人才来说，我上知天文下晓地理，前后三百年无人可超越。", },
	id_1013 = {1013, "设宴", 2, nil, 6, "160|0,180|1,200|2,220|3,240|4,260|5", "我最喜欢的就是大口喝酒大口吃肉！听说刘备做饭可好吃了。", "谢主公厚爱，末将必将粉身碎骨马革裹尸以报答主公知遇之恩。", "哈哈哈，大家喝啊！跳啊！那小白脸姜维好像有点小醉啊~好开心！", },
	id_1014 = {1014, "跳舞", 2, nil, 6, "160|0,180|1,200|2,220|3,240|4,260|5", "起舞弄清影，何似在人间。主公，我婀娜的身段是否令你神魂颠倒了呢？", "我最喜欢看妹纸们跳舞了，特别是那个张飞，跳得可好了哈哈哈！", "现在的一些妹纸，平日里只知道吃喝玩乐，再者就是跟男人跳跳舞聊聊天，对于这样的妹纸，我只想说请联系我！", },
	id_1015 = {1015, "占卜", 4, nil, 6, "320|0,360|1,400|2,440|3,480|4,520|5", "占卜的方式，有占星，观天象，看手相，水晶球，塔罗牌多种形式，不知主公喜欢哪种。", "昨日我深山偶遇一大仙儿，跟我说了一事，说跟着主公你定会前途无量。", "咦，据臣夜观天象，听说常玩放开那三国，再给个5星好评，有助于成就霸业。", },
	id_1016 = {1016, "对歌", 2, nil, 6, "160|0,180|1,200|2,220|3,240|4,260|5", "主公，你知道这首歌叫什么名字？当当当当当当，当当当，当当当当当！", "台下的观众你们好不好，大家一起来唱！妹妹你坐船头，哥哥在岸上走，恩恩爱爱纤绳荡悠悠", "对酒当歌，有你的世界在哪里，我和我的小伙伴们都惊呆了，曹操这首词写得果然是好啊！", },
	id_1017 = {1017, "拥抱", 4, nil, 6, "320|0,360|1,400|2,440|3,480|4,520|5", "这……主公这么多人看着……这样有点不太好吧……", "其实……抱抱的感觉貌似还不错……还有点小享受。", "嘻嘻嘻，我就喜欢主公你这样抱着人家！", },
}

local mt = {}
mt.__index = function (table, key)
	for i = 1, #keys do
		if (keys[i] == key) then
			return table[i]
		end
	end
end

function getDataById(key_id)
	local id_data = Star_act["id_" .. key_id]
	if id_data == nil then
		print("don't find data by id " .. key_id)
		return nil
	end
	if getmetatable(id_data) ~= nil then
		return id_data
	end
	setmetatable(id_data, mt)

	return id_data
end

function getArrDataByField(fieldName, fieldValue)
	local arrData = {}
	local fieldNo = 1
	for i=1, #keys do
		if keys[i] == fieldName then
			fieldNo = i
			break
		end
	end
	for k, v in pairs(Star_act) do
		if v[fieldNo] == fieldValue then
			setmetatable (v, mt)
			arrData[#arrData+1] = v
		end
	end

	return arrData
end

function release()
	_G["DB_Star_act"] = nil
	package.loaded["DB_Star_act"] = nil
	package.loaded["db/DB_Star_act"] = nil
end

