-- Filename: DB_Vip_desc.lua
-- Author: auto-created by XmlToScript tool.
-- Function: it`s auto-created by XmlToScript tool.

module("DB_Vip_desc", package.seeall)

keys = {
	"id", "desc", 
}

Vip_desc = {
	id_1 = {1, "※可购买Vip0礼包\n※每日可购买5个经验熊猫\n※每日可购买5个青玉宝簪\n※每日可购买5个黄金宝箱\n※每日可购买5个白银宝箱\n※每日可购买1个体力丹\n※每日可购买5个耐力丹\n※每日神秘商店可金币刷新10次\n※每2小时增加一次神秘商店免费刷新次数，最多可累计2次\n※强化可出现暴击，随机提高装备等级1~3级\n※每日可购买5次“试练塔”挑战次数\n※可开启4个宠物栏位\n※每日可刷新1次神秘商人\n※每日可购买1次精英副本攻打次数\n※每日可刷新1次占星奖励列表\n※每日可购买1次摇钱树副本攻打次数\n※每日可购买1次经验宝物副本攻打次数\n※每日可使用1次关公殿金币参拜", },
	id_2 = {2, "※可购买Vip1礼包\n※每日可购买10个招财符\n※每日可购买10个经验熊猫\n※每日可购买8个青玉宝簪\n※每日可购买10个黄金宝箱\n※每日可购买10个白银宝箱\n※每日可购买2个体力丹\n※每日可购买8个耐力丹\n※每日神秘商店可金币刷新20次\n※每2小时增加一次神秘商店免费刷新次数，最多可累计3次\n※强化可出现暴击，随机提高装备等级1~3级\n※每日可购买6次“试练塔”挑战次数\n※可开启4个宠物栏位\n※每日登陆可领取奖励：银币*10000\n※每日可刷新1次神秘商人\n※每日可购买1次精英副本攻打次数\n※每日可购买1次军团组队副本攻打次数\n※每日可刷新1次占星奖励列表\n※每日可购买1次摇钱树副本攻打次数\n※每日可购买1次经验宝物副本攻打次数\n※每日可使用1次关公殿金币参拜", },
	id_3 = {3, "※可购买Vip2礼包\n※每日可购买15个招财符\n※每日可购买15个经验熊猫\n※每日可购买10个青玉宝簪\n※每日可购买15个黄金宝箱\n※每日可购买15个白银宝箱\n※每日可购买2个体力丹\n※每日可购买8个耐力丹\n※每日神秘商店可金币刷新30次\n※每2小时增加一次神秘商店免费刷新次数，最多可累计3次\n※强化可出现暴击，随机提高装备等级2~4级\n※每日可购买7次“试练塔”挑战次数\n※可开启4个宠物栏位\n※每日登陆可领取奖励：银币*30000,强攻旗*1\n※每日可刷新1次神秘商人\n※每日可购买2次精英副本攻打次数\n※每日可购买1次军团组队副本攻打次数\n※每日可刷新1次占星奖励列表\n※每日可购买1次摇钱树副本攻打次数\n※每日可购买1次经验宝物副本攻打次数\n※每日可使用1次关公殿金币参拜", },
	id_4 = {4, "※可购买Vip3礼包\n※每日可购买20个招财符\n※每日可购买20个经验熊猫\n※每日可购买20个青玉宝簪\n※每日可购买20个黄金宝箱\n※每日可购买20个白银宝箱\n※每日可购买4个体力丹\n※每日可购买10个耐力丹\n※每日神秘商店可金币刷新40次\n※每2小时增加一次神秘商店免费刷新次数，最多可累计3次\n※强化可出现暴击，随机提高装备等级2~4级\n※每日可购买8次“试练塔”挑战次数\n※可开启5个宠物栏位\n※每日登陆可领取奖励：银币*50000,经验熊猫*1,强攻旗*1\n※每日可刷新2次神秘商人\n※每日可购买2次精英副本攻打次数\n※每日可购买1次军团组队副本攻打次数\n※每日可刷新1次占星奖励列表\n※每日可购买1次摇钱树副本攻打次数\n※每日可购买2次经验宝物副本攻打次数\n※每日可使用1次关公殿金币参拜\n※开启寻龙探宝答题事件自动显示答案", },
	id_5 = {5, "※可购买Vip4礼包\n※每日可购买25个招财符\n※每日可购买25个经验熊猫\n※每日可购买20个青玉宝簪\n※每日可购买25个黄金宝箱\n※每日可购买25个白银宝箱\n※每日可购买4个体力丹\n※每日可购买10个耐力丹\n※每日神秘商店可金币刷新50次\n※每2小时增加一次神秘商店免费刷新次数，最多可累计3次\n※强化可出现暴击，随机提高装备等级2~4级\n※每日可购买9次“试练塔”挑战次数\n※可开启5个宠物栏位\n※每日登陆可领取奖励：银币*80000,经验熊猫*1,占星令*1,强攻旗*1\n※每日可刷新2次神秘商人\n※每日可购买2次精英副本攻打次数\n※每日可购买2次军团组队副本攻打次数\n※每日可刷新1次占星奖励列表\n※每日可购买1次摇钱树副本攻打次数\n※每日可购买2次经验宝物副本攻打次数\n※每日可使用1次关公殿金币参拜\n※开启寻龙探宝答题事件自动显示答案", },
	id_6 = {6, "※可购买Vip5礼包\n※每日可购买30个招财符\n※每日可购买30个经验熊猫\n※每日可购买30个青玉宝簪\n※每日可购买30个黄金宝箱\n※每日可购买30个白银宝箱\n※每日可购买6个体力丹\n※每日可购买15个耐力丹\n※每日神秘商店可金币刷新60次\n※每2小时增加一次神秘商店免费刷新次数，最多可累计4次\n※强化可出现暴击，随机提高装备等级2~5级\n※可开启活动“进击的魔神”自动攻击\n※每日可购买10次“试练塔”挑战次数\n※可开启6个宠物栏位\n※每日登陆可领取奖励：银币*100000,经验熊猫*2,神秘刷新令*1,占星令*1,强攻旗*1\n※每日可刷新2次神秘商人\n※每日可购买3次精英副本攻打次数\n※每日可购买2次军团组队副本攻打次数\n※每日可刷新2次占星奖励列表\n※每日可购买1次摇钱树副本攻打次数\n※每日可购买2次经验宝物副本攻打次数\n※每日可使用1次关公殿金币参拜\n※可使用城池争夺战离线入场功能\n※开启寻龙探宝答题事件自动显示答案", },
	id_7 = {7, "※可购买Vip6礼包\n※每日可购买35个招财符\n※每日可购买35个经验熊猫\n※每日可购买30个青玉宝簪\n※每日可购买35个黄金宝箱\n※每日可购买35个白银宝箱\n※每日可购买8个体力丹\n※每日可购买15个耐力丹\n※每日神秘商店可金币刷新70次\n※每2小时增加一次神秘商店免费刷新次数，最多可累计4次\n※强化可出现暴击，随机提高装备等级2~5级\n※可开启活动“进击的魔神”自动攻击\n※每日可购买11次“试练塔”挑战次数\n※可开启6个宠物栏位\n※每日登陆可领取奖励：银币*120000,经验熊猫*2,神秘刷新令*1,占星令*1,强攻旗*2\n※每日可刷新3次神秘商人\n※每日可购买3次精英副本攻打次数\n※每日可购买2次军团组队副本攻打次数\n※每日可购买1次试练塔重置次数\n※每日可刷新2次占星奖励列表\n※每日可购买1次摇钱树副本攻打次数\n※每日可购买2次经验宝物副本攻打次数\n※每日可使用1次关公殿金币参拜\n※可花费金币召唤试练塔神秘层\n※可使用城池争夺战离线入场功能\n※开启寻龙探宝答题事件自动显示答案", },
	id_8 = {8, "※可购买Vip7礼包\n※每日可购买40个招财符\n※每日可购买40个经验熊猫\n※每日可购买40个青玉宝簪\n※每日可购买40个黄金宝箱\n※每日可购买40个白银宝箱\n※每日可购买8个体力丹\n※每日可购买20个耐力丹\n※每日神秘商店可金币刷新80次\n※每2小时增加一次神秘商店免费刷新次数，最多可累计4次\n※强化可出现暴击，随机提高装备等级2~5级\n※可开启活动“进击的魔神”自动攻击\n※每日可购买12次“试练塔”挑战次数\n※可开启7个宠物栏位\n※每日登陆可领取奖励：银币*150000,经验熊猫*3,神秘刷新令*1,神龙令*1,占星令*1,强攻旗*2\n※每日可刷新3次神秘商人\n※每日可购买3次精英副本攻打次数\n※每日可购买3次军团组队副本攻打次数\n※每日可购买1次试练塔重置次数\n※每日可刷新3次占星奖励列表\n※每日可购买1次摇钱树副本攻打次数\n※每日可购买3次经验宝物副本攻打次数\n※每日可使用1次关公殿金币参拜\n※可花费金币召唤试练塔神秘层\n※可使用城池争夺战离线入场功能\n※开启寻龙探宝答题事件自动显示答案", },
	id_9 = {9, "※可购买Vip8礼包\n※每日可购买60个招财符\n※每日可购买60个经验熊猫\n※每日可购买40个青玉宝簪\n※每日可购买45个黄金宝箱\n※每日可购买45个白银宝箱\n※每日可购买10个体力丹\n※每日可购买20个耐力丹\n※每日神秘商店可金币刷新90次\n※每2小时增加一次神秘商店免费刷新次数，最多可累计4次\n※强化可出现暴击，随机提高装备等级2~5级\n※可开启活动“进击的魔神”自动攻击\n※每日可购买13次“试练塔”挑战次数\n※可开启7个宠物栏位\n※每日登陆可领取奖励：银币*200000,经验熊猫*3,神秘刷新令*2,神龙令*1,占星令*1,强攻旗*2\n※达到40级后可跳过战斗直接查看战斗结果\n※每日可刷新3次神秘商人\n※每日可购买4次精英副本攻打次数\n※每日可购买3次军团组队副本攻打次数\n※每日可购买1次试练塔重置次数\n※每日可刷新3次占星奖励列表\n※每日可购买2次摇钱树副本攻打次数\n※每日可购买3次经验宝物副本攻打次数\n※每日可使用1次关公殿金币参拜\n※人物达到40级后可花费金币永久开启神秘商人\n※可花费金币召唤试练塔神秘层\n※可使用城池争夺战离线入场功能\n※开启寻龙探宝答题事件自动显示答案", },
	id_10 = {10, "※可购买Vip9礼包\n※每日可购买80个招财符\n※每日可购买80个经验熊猫\n※每日可购买50个青玉宝簪\n※每日可购买50个黄金宝箱\n※每日可购买50个白银宝箱\n※每日可购买11个体力丹\n※每日可购买25个耐力丹\n※每日神秘商店可金币刷新100次\n※每2小时增加一次神秘商店免费刷新次数，最多可累计4次\n※强化可出现暴击，随机提高装备等级3~5级\n※可开启活动“进击的魔神”自动攻击\n※每日可购买14次“试练塔”挑战次数\n※可开启8个宠物栏位\n※每日登陆可领取奖励：银币*250000,经验熊猫*3,神秘刷新令*2,神龙令*1,伐树令*1,占星令*1,强攻旗*2\n※达到40级后可跳过战斗直接查看战斗结果\n※每日可刷新4次神秘商人\n※每日可购买4次精英副本攻打次数\n※每日可购买3次军团组队副本攻打次数\n※每日可购买1次试练塔重置次数\n※每日可刷新4次占星奖励列表\n※每日可购买2次摇钱树副本攻打次数\n※每日可购买3次经验宝物副本攻打次数\n※每日可使用1次关公殿金币参拜\n※人物达到40级后可花费金币永久开启神秘商人\n※可花费金币召唤试练塔神秘层\n※可使用城池争夺战离线入场功能\n※开启寻龙探宝答题事件自动显示答案", },
	id_11 = {11, "※可购买Vip10礼包\n※每日可购买100个招财符\n※每日可购买100个经验熊猫\n※每日可购买50个青玉宝簪\n※每日可购买55个黄金宝箱\n※每日可购买55个白银宝箱\n※每日可购买12个体力丹\n※每日可购买25个耐力丹\n※每日神秘商店可金币刷新150次\n※每2小时增加一次神秘商店免费刷新次数，最多可累计4次\n※强化可出现暴击，随机提高装备等级3~5级\n※可开启活动“进击的魔神”自动攻击\n※每日可购买15次“试练塔”挑战次数\n※可开启8个宠物栏位\n※每日登陆可领取奖励：银币*300000,经验熊猫*4,神秘刷新令*2,神龙令*2,伐树令*1,占星令*1,强攻旗*2\n※达到40级后可跳过战斗直接查看战斗结果\n※每日可刷新4次神秘商人\n※每日可购买5次精英副本攻打次数\n※每日可购买3次军团组队副本攻打次数\n※每日可购买1次试练塔重置次数\n※每日可刷新4次占星奖励列表\n※每日可购买2次摇钱树副本攻打次数\n※每日可购买4次经验宝物副本攻打次数\n※每日可使用1次关公殿金币参拜\n※人物达到40级后可花费金币永久开启神秘商人\n※可花费金币召唤试练塔神秘层\n※可使用城池争夺战离线入场功能\n※开启寻龙探宝答题事件自动显示答案", },
	id_12 = {12, "※可购买Vip11礼包\n※每日可购买110个招财符\n※每日可购买110个经验熊猫\n※每日可购买60个青玉宝簪\n※每日可购买60个黄金宝箱\n※每日可购买60个白银宝箱\n※每日可购买13个体力丹\n※每日可购买30个耐力丹\n※每日神秘商店可金币刷新160次\n※每2小时增加一次神秘商店免费刷新次数，最多可累计4次\n※强化可出现暴击，随机提高装备等级3~5级\n※可开启活动“进击的魔神”自动攻击\n※每日可购买16次“试练塔”挑战次数\n※可开启8个宠物栏位\n※每日登陆可领取奖励：银币*350000,经验熊猫*4,神秘刷新令*2,神龙令*2,伐树令*1,占星令*1,强攻旗*2\n※达到40级后可跳过战斗直接查看战斗结果\n※每日可刷新4次神秘商人\n※每日可购买5次精英副本攻打次数\n※每日可购买4次军团组队副本攻打次数\n※每日可购买1次试练塔重置次数\n※每日可刷新4次占星奖励列表\n※每日可购买2次摇钱树副本攻打次数\n※每日可购买4次经验宝物副本攻打次数\n※每日可使用1次关公殿金币参拜\n※人物达到40级后可花费金币永久开启神秘商人\n※可花费金币召唤试练塔神秘层\n※可使用城池争夺战离线入场功能\n※开启寻龙探宝答题事件自动显示答案", },
	id_13 = {13, "※可购买Vip12礼包\n※每日可购买120个招财符\n※每日可购买120个经验熊猫\n※每日可购买60个青玉宝簪\n※每日可购买65个黄金宝箱\n※每日可购买65个白银宝箱\n※每日可购买14个体力丹\n※每日可购买30个耐力丹\n※每日神秘商店可金币刷新170次\n※每2小时增加一次神秘商店免费刷新次数，最多可累计4次\n※强化可出现暴击，随机提高装备等级3~5级\n※可开启活动“进击的魔神”自动攻击\n※每日可购买17次“试练塔”挑战次数\n※可开启8个宠物栏位\n※每日登陆可领取奖励：银币*400000,经验熊猫*4,神秘刷新令*2,神龙令*2,伐树令*1,占星令*2,强攻旗*2\n※达到40级后可跳过战斗直接查看战斗结果\n※每日可刷新5次神秘商人\n※每日可购买5次精英副本攻打次数\n※每日可购买4次军团组队副本攻打次数\n※每日可购买1次试练塔重置次数\n※每日可刷新4次占星奖励列表\n※每日可购买2次摇钱树副本攻打次数\n※每日可购买4次经验宝物副本攻打次数\n※每日可使用1次\n※开启寻龙探宝答题事件自动显示答案关公殿金币参拜\n※人物达到40级后可花费金币永久开启神秘商人\n※可花费金币召唤试练塔神秘层\n※可使用城池争夺战离线入场功能", },
	id_14 = {14, "※可购买Vip13礼包\n※每日可购买130个招财符\n※每日可购买130个经验熊猫\n※每日可购买70个青玉宝簪\n※每日可购买70个黄金宝箱\n※每日可购买70个白银宝箱\n※每日可购买15个体力丹\n※每日可购买35个耐力丹\n※每日神秘商店可金币刷新180次\n※每2小时增加一次神秘商店免费刷新次数，最多可累计4次\n※强化可出现暴击，随机提高装备等级3~5级\n※可开启活动“进击的魔神”自动攻击\n※每日可购买18次“试练塔”挑战次数\n※可开启8个宠物栏位\n※每日登陆可领取奖励：银币*450000,经验熊猫*4,神秘刷新令*2,神龙令*2,伐树令*1,占星令*2,强攻旗*2\n※达到40级后可跳过战斗直接查看战斗结果\n※每日可刷新5次神秘商人\n※每日可购买5次精英副本攻打次数\n※每日可购买4次军团组队副本攻打次数\n※每日可购买1次试练塔重置次数\n※每日可刷新4次占星奖励列表\n※每日可购买2次摇钱树副本攻打次数\n※每日可购买4次经验宝物副本攻打次数\n※每日可使用1次关公殿金币参拜\n※人物达到40级后可花费金币永久开启神秘商人\n※可花费金币召唤试练塔神秘层\n※可使用城池争夺战离线入场功能\n※开启寻龙探宝答题事件自动显示答案", },
	id_15 = {15, "※可购买Vip14礼包\n※每日可购买150个招财符\n※每日可购买150个经验熊猫\n※每日可购买70个青玉宝簪\n※每日可购买75个黄金宝箱\n※每日可购买75个白银宝箱\n※每日可购买16个体力丹\n※每日可购买40个耐力丹\n※每日神秘商店可金币刷新200次\n※每2小时增加一次神秘商店免费刷新次数，最多可累计4次\n※强化可出现暴击，随机提高装备等级3~5级\n※可开启活动“进击的魔神”自动攻击\n※每日可购买20次“试练塔”挑战次数\n※可开启8个宠物栏位\n※每日登陆可领取奖励：银币*500000,经验熊猫*4,神秘刷新令*3,神龙令*2,伐树令*1,占星令*2,强攻旗*2\n※达到40级后可跳过战斗直接查看战斗结果\n※每日可刷新5次神秘商人\n※每日可购买5次精英副本攻打次数\n※每日可购买4次军团组队副本攻打次数\n※每日可购买1次试练塔重置次数\n※每日可刷新4次占星奖励列表\n※每日可购买2次摇钱树副本攻打次数\n※每日可购买4次经验宝物副本攻打次数\n※每日可使用1次关公殿金币参拜\n※人物达到40级后可花费金币永久开启神秘商人\n※可花费金币召唤试练塔神秘层\n※可使用城池争夺战离线入场功能\n※开启寻龙探宝答题事件自动显示答案", },
}

local mt = {}
mt.__index = function (table, key)
	for i = 1, #keys do
		if (keys[i] == key) then
			return table[i]
		end
	end
end

function getDataById(key_id)
	local id_data = Vip_desc["id_" .. key_id]
	if id_data == nil then
		print("don't find data by id " .. key_id)
		return nil
	end
	if getmetatable(id_data) ~= nil then
		return id_data
	end
	setmetatable(id_data, mt)

	return id_data
end

function getArrDataByField(fieldName, fieldValue)
	local arrData = {}
	local fieldNo = 1
	for i=1, #keys do
		if keys[i] == fieldName then
			fieldNo = i
			break
		end
	end
	for k, v in pairs(Vip_desc) do
		if v[fieldNo] == fieldValue then
			setmetatable (v, mt)
			arrData[#arrData+1] = v
		end
	end

	return arrData
end

function release()
	_G["DB_Vip_desc"] = nil
	package.loaded["DB_Vip_desc"] = nil
	package.loaded["db/DB_Vip_desc"] = nil
end

